Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0xc92 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 23 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x73538): GNU C11 12.3.1 20230626 -mcpu=cortex-m7 -mfpu=fpv5-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fpv5 -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0xc7253): ../Core/Src/main.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x98ce9): C:/Users/asus/STM32CubeIDE/workspace_1.14.1/TorqueSensor/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 6 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x6ff02): signed char
 <1><31>: Abbrev Number: 6 (DW_TAG_base_type)
    <32>   DW_AT_byte_size   : 1
    <33>   DW_AT_encoding    : 8	(unsigned char)
    <34>   DW_AT_name        : (indirect string, offset: 0xd7c31): unsigned char
 <1><38>: Abbrev Number: 6 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 2
    <3a>   DW_AT_encoding    : 5	(signed)
    <3b>   DW_AT_name        : (indirect string, offset: 0xa67e2): short int
 <1><3f>: Abbrev Number: 3 (DW_TAG_typedef)
    <40>   DW_AT_name        : (indirect string, offset: 0xb672f): __uint16_t
    <44>   DW_AT_decl_file   : 3
    <45>   DW_AT_decl_line   : 57
    <46>   DW_AT_decl_column : 25
    <47>   DW_AT_type        : <0x4b>
 <1><4b>: Abbrev Number: 6 (DW_TAG_base_type)
    <4c>   DW_AT_byte_size   : 2
    <4d>   DW_AT_encoding    : 7	(unsigned)
    <4e>   DW_AT_name        : (indirect string, offset: 0xd63c2): short unsigned int
 <1><52>: Abbrev Number: 6 (DW_TAG_base_type)
    <53>   DW_AT_byte_size   : 4
    <54>   DW_AT_encoding    : 5	(signed)
    <55>   DW_AT_name        : (indirect string, offset: 0x1308b): long int
 <1><59>: Abbrev Number: 3 (DW_TAG_typedef)
    <5a>   DW_AT_name        : (indirect string, offset: 0x8d8f5): __uint32_t
    <5e>   DW_AT_decl_file   : 3
    <5f>   DW_AT_decl_line   : 79
    <60>   DW_AT_decl_column : 25
    <61>   DW_AT_type        : <0x65>
 <1><65>: Abbrev Number: 6 (DW_TAG_base_type)
    <66>   DW_AT_byte_size   : 4
    <67>   DW_AT_encoding    : 7	(unsigned)
    <68>   DW_AT_name        : (indirect string, offset: 0x559ba): long unsigned int
 <1><6c>: Abbrev Number: 6 (DW_TAG_base_type)
    <6d>   DW_AT_byte_size   : 8
    <6e>   DW_AT_encoding    : 5	(signed)
    <6f>   DW_AT_name        : (indirect string, offset: 0x660a1): long long int
 <1><73>: Abbrev Number: 6 (DW_TAG_base_type)
    <74>   DW_AT_byte_size   : 8
    <75>   DW_AT_encoding    : 7	(unsigned)
    <76>   DW_AT_name        : (indirect string, offset: 0x2ee33): long long unsigned int
 <1><7a>: Abbrev Number: 24 (DW_TAG_base_type)
    <7b>   DW_AT_byte_size   : 4
    <7c>   DW_AT_encoding    : 5	(signed)
    <7d>   DW_AT_name        : int
 <1><81>: Abbrev Number: 6 (DW_TAG_base_type)
    <82>   DW_AT_byte_size   : 4
    <83>   DW_AT_encoding    : 7	(unsigned)
    <84>   DW_AT_name        : (indirect string, offset: 0x12332): unsigned int
 <1><88>: Abbrev Number: 3 (DW_TAG_typedef)
    <89>   DW_AT_name        : (indirect string, offset: 0xb6731): uint16_t
    <8d>   DW_AT_decl_file   : 4
    <8e>   DW_AT_decl_line   : 36
    <8f>   DW_AT_decl_column : 20
    <90>   DW_AT_type        : <0x3f>
 <1><94>: Abbrev Number: 3 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0x8d8f7): uint32_t
    <99>   DW_AT_decl_file   : 4
    <9a>   DW_AT_decl_line   : 48
    <9b>   DW_AT_decl_column : 20
    <9c>   DW_AT_type        : <0x59>
 <1><a0>: Abbrev Number: 17 (DW_TAG_volatile_type)
    <a1>   DW_AT_type        : <0x94>
 <1><a5>: Abbrev Number: 20 (DW_TAG_array_type)
    <a6>   DW_AT_type        : <0x94>
    <aa>   DW_AT_sibling     : <0xb4>
 <2><ae>: Abbrev Number: 21 (DW_TAG_subrange_type)
    <af>   DW_AT_type        : <0x81>
    <b3>   DW_AT_upper_bound : 1
 <2><b3>: Abbrev Number: 0
 <1><b4>: Abbrev Number: 9 (DW_TAG_structure_type)
    <b5>   DW_AT_byte_size   : 80
    <b6>   DW_AT_decl_file   : 5
    <b7>   DW_AT_decl_line   : 187
    <b8>   DW_AT_decl_column : 9
    <b8>   DW_AT_sibling     : <0x1bf>
 <2><bc>: Abbrev Number: 10 (DW_TAG_member)
    <bd>   DW_AT_name        : SR
    <c0>   DW_AT_decl_file   : 5
    <c1>   DW_AT_decl_line   : 189
    <c2>   DW_AT_decl_column : 17
    <c3>   DW_AT_type        : <0xa0>
    <c7>   DW_AT_data_member_location: 0
 <2><c8>: Abbrev Number: 10 (DW_TAG_member)
    <c9>   DW_AT_name        : CR1
    <cd>   DW_AT_decl_file   : 5
    <ce>   DW_AT_decl_line   : 190
    <cf>   DW_AT_decl_column : 17
    <d0>   DW_AT_type        : <0xa0>
    <d4>   DW_AT_data_member_location: 4
 <2><d5>: Abbrev Number: 10 (DW_TAG_member)
    <d6>   DW_AT_name        : CR2
    <da>   DW_AT_decl_file   : 5
    <db>   DW_AT_decl_line   : 191
    <dc>   DW_AT_decl_column : 17
    <dd>   DW_AT_type        : <0xa0>
    <e1>   DW_AT_data_member_location: 8
 <2><e2>: Abbrev Number: 1 (DW_TAG_member)
    <e3>   DW_AT_name        : (indirect string, offset: 0xbe54b): SMPR1
    <e7>   DW_AT_decl_file   : 5
    <e8>   DW_AT_decl_line   : 192
    <e9>   DW_AT_decl_column : 17
    <ea>   DW_AT_type        : <0xa0>
    <ee>   DW_AT_data_member_location: 12
 <2><ef>: Abbrev Number: 1 (DW_TAG_member)
    <f0>   DW_AT_name        : (indirect string, offset: 0x5040e): SMPR2
    <f4>   DW_AT_decl_file   : 5
    <f5>   DW_AT_decl_line   : 193
    <f6>   DW_AT_decl_column : 17
    <f7>   DW_AT_type        : <0xa0>
    <fb>   DW_AT_data_member_location: 16
 <2><fc>: Abbrev Number: 1 (DW_TAG_member)
    <fd>   DW_AT_name        : (indirect string, offset: 0x4d118): JOFR1
    <101>   DW_AT_decl_file   : 5
    <102>   DW_AT_decl_line   : 194
    <103>   DW_AT_decl_column : 17
    <104>   DW_AT_type        : <0xa0>
    <108>   DW_AT_data_member_location: 20
 <2><109>: Abbrev Number: 1 (DW_TAG_member)
    <10a>   DW_AT_name        : (indirect string, offset: 0x4d11e): JOFR2
    <10e>   DW_AT_decl_file   : 5
    <10f>   DW_AT_decl_line   : 195
    <110>   DW_AT_decl_column : 17
    <111>   DW_AT_type        : <0xa0>
    <115>   DW_AT_data_member_location: 24
 <2><116>: Abbrev Number: 1 (DW_TAG_member)
    <117>   DW_AT_name        : (indirect string, offset: 0x4d124): JOFR3
    <11b>   DW_AT_decl_file   : 5
    <11c>   DW_AT_decl_line   : 196
    <11d>   DW_AT_decl_column : 17
    <11e>   DW_AT_type        : <0xa0>
    <122>   DW_AT_data_member_location: 28
 <2><123>: Abbrev Number: 1 (DW_TAG_member)
    <124>   DW_AT_name        : (indirect string, offset: 0x30517): JOFR4
    <128>   DW_AT_decl_file   : 5
    <129>   DW_AT_decl_line   : 197
    <12a>   DW_AT_decl_column : 17
    <12b>   DW_AT_type        : <0xa0>
    <12f>   DW_AT_data_member_location: 32
 <2><130>: Abbrev Number: 10 (DW_TAG_member)
    <131>   DW_AT_name        : HTR
    <135>   DW_AT_decl_file   : 5
    <136>   DW_AT_decl_line   : 198
    <137>   DW_AT_decl_column : 17
    <138>   DW_AT_type        : <0xa0>
    <13c>   DW_AT_data_member_location: 36
 <2><13d>: Abbrev Number: 10 (DW_TAG_member)
    <13e>   DW_AT_name        : LTR
    <142>   DW_AT_decl_file   : 5
    <143>   DW_AT_decl_line   : 199
    <144>   DW_AT_decl_column : 17
    <145>   DW_AT_type        : <0xa0>
    <149>   DW_AT_data_member_location: 40
 <2><14a>: Abbrev Number: 1 (DW_TAG_member)
    <14b>   DW_AT_name        : (indirect string, offset: 0x9b80f): SQR1
    <14f>   DW_AT_decl_file   : 5
    <150>   DW_AT_decl_line   : 200
    <151>   DW_AT_decl_column : 17
    <152>   DW_AT_type        : <0xa0>
    <156>   DW_AT_data_member_location: 44
 <2><157>: Abbrev Number: 1 (DW_TAG_member)
    <158>   DW_AT_name        : (indirect string, offset: 0x10fd6): SQR2
    <15c>   DW_AT_decl_file   : 5
    <15d>   DW_AT_decl_line   : 201
    <15e>   DW_AT_decl_column : 17
    <15f>   DW_AT_type        : <0xa0>
    <163>   DW_AT_data_member_location: 48
 <2><164>: Abbrev Number: 1 (DW_TAG_member)
    <165>   DW_AT_name        : (indirect string, offset: 0x10fdb): SQR3
    <169>   DW_AT_decl_file   : 5
    <16a>   DW_AT_decl_line   : 202
    <16b>   DW_AT_decl_column : 17
    <16c>   DW_AT_type        : <0xa0>
    <170>   DW_AT_data_member_location: 52
 <2><171>: Abbrev Number: 1 (DW_TAG_member)
    <172>   DW_AT_name        : (indirect string, offset: 0x48749): JSQR
    <176>   DW_AT_decl_file   : 5
    <177>   DW_AT_decl_line   : 203
    <178>   DW_AT_decl_column : 17
    <179>   DW_AT_type        : <0xa0>
    <17d>   DW_AT_data_member_location: 56
 <2><17e>: Abbrev Number: 1 (DW_TAG_member)
    <17f>   DW_AT_name        : (indirect string, offset: 0x8e933): JDR1
    <183>   DW_AT_decl_file   : 5
    <184>   DW_AT_decl_line   : 204
    <185>   DW_AT_decl_column : 17
    <186>   DW_AT_type        : <0xa0>
    <18a>   DW_AT_data_member_location: 60
 <2><18b>: Abbrev Number: 1 (DW_TAG_member)
    <18c>   DW_AT_name        : (indirect string, offset: 0x8e938): JDR2
    <190>   DW_AT_decl_file   : 5
    <191>   DW_AT_decl_line   : 205
    <192>   DW_AT_decl_column : 17
    <193>   DW_AT_type        : <0xa0>
    <197>   DW_AT_data_member_location: 64
 <2><198>: Abbrev Number: 1 (DW_TAG_member)
    <199>   DW_AT_name        : (indirect string, offset: 0x8e93d): JDR3
    <19d>   DW_AT_decl_file   : 5
    <19e>   DW_AT_decl_line   : 206
    <19f>   DW_AT_decl_column : 17
    <1a0>   DW_AT_type        : <0xa0>
    <1a4>   DW_AT_data_member_location: 68
 <2><1a5>: Abbrev Number: 1 (DW_TAG_member)
    <1a6>   DW_AT_name        : (indirect string, offset: 0x3b90b): JDR4
    <1aa>   DW_AT_decl_file   : 5
    <1ab>   DW_AT_decl_line   : 207
    <1ac>   DW_AT_decl_column : 17
    <1ad>   DW_AT_type        : <0xa0>
    <1b1>   DW_AT_data_member_location: 72
 <2><1b2>: Abbrev Number: 10 (DW_TAG_member)
    <1b3>   DW_AT_name        : DR
    <1b6>   DW_AT_decl_file   : 5
    <1b7>   DW_AT_decl_line   : 208
    <1b8>   DW_AT_decl_column : 17
    <1b9>   DW_AT_type        : <0xa0>
    <1bd>   DW_AT_data_member_location: 76
 <2><1be>: Abbrev Number: 0
 <1><1bf>: Abbrev Number: 3 (DW_TAG_typedef)
    <1c0>   DW_AT_name        : (indirect string, offset: 0xab867): ADC_TypeDef
    <1c4>   DW_AT_decl_file   : 5
    <1c5>   DW_AT_decl_line   : 209
    <1c6>   DW_AT_decl_column : 3
    <1c7>   DW_AT_type        : <0xb4>
 <1><1cb>: Abbrev Number: 14 (DW_TAG_structure_type)
    <1cc>   DW_AT_byte_size   : 24
    <1cd>   DW_AT_decl_file   : 5
    <1cd>   DW_AT_decl_line   : 372
    <1cf>   DW_AT_decl_column : 9
    <1cf>   DW_AT_sibling     : <0x21b>
 <2><1d3>: Abbrev Number: 7 (DW_TAG_member)
    <1d4>   DW_AT_name        : CR
    <1d7>   DW_AT_decl_file   : 5
    <1d7>   DW_AT_decl_line   : 374
    <1d9>   DW_AT_decl_column : 17
    <1d9>   DW_AT_type        : <0xa0>
    <1dd>   DW_AT_data_member_location: 0
 <2><1de>: Abbrev Number: 2 (DW_TAG_member)
    <1df>   DW_AT_name        : (indirect string, offset: 0x1ac14): NDTR
    <1e3>   DW_AT_decl_file   : 5
    <1e3>   DW_AT_decl_line   : 375
    <1e5>   DW_AT_decl_column : 17
    <1e5>   DW_AT_type        : <0xa0>
    <1e9>   DW_AT_data_member_location: 4
 <2><1ea>: Abbrev Number: 7 (DW_TAG_member)
    <1eb>   DW_AT_name        : PAR
    <1ef>   DW_AT_decl_file   : 5
    <1ef>   DW_AT_decl_line   : 376
    <1f1>   DW_AT_decl_column : 17
    <1f1>   DW_AT_type        : <0xa0>
    <1f5>   DW_AT_data_member_location: 8
 <2><1f6>: Abbrev Number: 2 (DW_TAG_member)
    <1f7>   DW_AT_name        : (indirect string, offset: 0x5d1e8): M0AR
    <1fb>   DW_AT_decl_file   : 5
    <1fb>   DW_AT_decl_line   : 377
    <1fd>   DW_AT_decl_column : 17
    <1fd>   DW_AT_type        : <0xa0>
    <201>   DW_AT_data_member_location: 12
 <2><202>: Abbrev Number: 2 (DW_TAG_member)
    <203>   DW_AT_name        : (indirect string, offset: 0x7b231): M1AR
    <207>   DW_AT_decl_file   : 5
    <207>   DW_AT_decl_line   : 378
    <209>   DW_AT_decl_column : 17
    <209>   DW_AT_type        : <0xa0>
    <20d>   DW_AT_data_member_location: 16
 <2><20e>: Abbrev Number: 7 (DW_TAG_member)
    <20f>   DW_AT_name        : FCR
    <213>   DW_AT_decl_file   : 5
    <213>   DW_AT_decl_line   : 379
    <215>   DW_AT_decl_column : 17
    <215>   DW_AT_type        : <0xa0>
    <219>   DW_AT_data_member_location: 20
 <2><21a>: Abbrev Number: 0
 <1><21b>: Abbrev Number: 15 (DW_TAG_typedef)
    <21c>   DW_AT_name        : (indirect string, offset: 0x1bc1f): DMA_Stream_TypeDef
    <220>   DW_AT_decl_file   : 5
    <220>   DW_AT_decl_line   : 380
    <222>   DW_AT_decl_column : 3
    <222>   DW_AT_type        : <0x1cb>
 <1><226>: Abbrev Number: 20 (DW_TAG_array_type)
    <227>   DW_AT_type        : <0xa0>
    <22b>   DW_AT_sibling     : <0x235>
 <2><22f>: Abbrev Number: 21 (DW_TAG_subrange_type)
    <230>   DW_AT_type        : <0x81>
    <234>   DW_AT_upper_bound : 1
 <2><234>: Abbrev Number: 0
 <1><235>: Abbrev Number: 17 (DW_TAG_volatile_type)
    <236>   DW_AT_type        : <0x226>
 <1><23a>: Abbrev Number: 14 (DW_TAG_structure_type)
    <23b>   DW_AT_byte_size   : 40
    <23c>   DW_AT_decl_file   : 5
    <23c>   DW_AT_decl_line   : 579
    <23e>   DW_AT_decl_column : 9
    <23e>   DW_AT_sibling     : <0x2af>
 <2><242>: Abbrev Number: 2 (DW_TAG_member)
    <243>   DW_AT_name        : (indirect string, offset: 0x1883): MODER
    <247>   DW_AT_decl_file   : 5
    <247>   DW_AT_decl_line   : 581
    <249>   DW_AT_decl_column : 17
    <249>   DW_AT_type        : <0xa0>
    <24d>   DW_AT_data_member_location: 0
 <2><24e>: Abbrev Number: 2 (DW_TAG_member)
    <24f>   DW_AT_name        : (indirect string, offset: 0xad1ae): OTYPER
    <253>   DW_AT_decl_file   : 5
    <253>   DW_AT_decl_line   : 582
    <255>   DW_AT_decl_column : 17
    <255>   DW_AT_type        : <0xa0>
    <259>   DW_AT_data_member_location: 4
 <2><25a>: Abbrev Number: 2 (DW_TAG_member)
    <25b>   DW_AT_name        : (indirect string, offset: 0xc278b): OSPEEDR
    <25f>   DW_AT_decl_file   : 5
    <25f>   DW_AT_decl_line   : 583
    <261>   DW_AT_decl_column : 17
    <261>   DW_AT_type        : <0xa0>
    <265>   DW_AT_data_member_location: 8
 <2><266>: Abbrev Number: 2 (DW_TAG_member)
    <267>   DW_AT_name        : (indirect string, offset: 0x9043e): PUPDR
    <26b>   DW_AT_decl_file   : 5
    <26b>   DW_AT_decl_line   : 584
    <26d>   DW_AT_decl_column : 17
    <26d>   DW_AT_type        : <0xa0>
    <271>   DW_AT_data_member_location: 12
 <2><272>: Abbrev Number: 7 (DW_TAG_member)
    <273>   DW_AT_name        : IDR
    <277>   DW_AT_decl_file   : 5
    <277>   DW_AT_decl_line   : 585
    <279>   DW_AT_decl_column : 17
    <279>   DW_AT_type        : <0xa0>
    <27d>   DW_AT_data_member_location: 16
 <2><27e>: Abbrev Number: 7 (DW_TAG_member)
    <27f>   DW_AT_name        : ODR
    <283>   DW_AT_decl_file   : 5
    <283>   DW_AT_decl_line   : 586
    <285>   DW_AT_decl_column : 17
    <285>   DW_AT_type        : <0xa0>
    <289>   DW_AT_data_member_location: 20
 <2><28a>: Abbrev Number: 2 (DW_TAG_member)
    <28b>   DW_AT_name        : (indirect string, offset: 0x32576): BSRR
    <28f>   DW_AT_decl_file   : 5
    <28f>   DW_AT_decl_line   : 587
    <291>   DW_AT_decl_column : 17
    <291>   DW_AT_type        : <0xa0>
    <295>   DW_AT_data_member_location: 24
 <2><296>: Abbrev Number: 2 (DW_TAG_member)
    <297>   DW_AT_name        : (indirect string, offset: 0xbfed1): LCKR
    <29b>   DW_AT_decl_file   : 5
    <29b>   DW_AT_decl_line   : 588
    <29d>   DW_AT_decl_column : 17
    <29d>   DW_AT_type        : <0xa0>
    <2a1>   DW_AT_data_member_location: 28
 <2><2a2>: Abbrev Number: 7 (DW_TAG_member)
    <2a3>   DW_AT_name        : AFR
    <2a7>   DW_AT_decl_file   : 5
    <2a7>   DW_AT_decl_line   : 589
    <2a9>   DW_AT_decl_column : 17
    <2a9>   DW_AT_type        : <0x235>
    <2ad>   DW_AT_data_member_location: 32
 <2><2ae>: Abbrev Number: 0
 <1><2af>: Abbrev Number: 15 (DW_TAG_typedef)
    <2b0>   DW_AT_name        : (indirect string, offset: 0xd908d): GPIO_TypeDef
    <2b4>   DW_AT_decl_file   : 5
    <2b4>   DW_AT_decl_line   : 590
    <2b6>   DW_AT_decl_column : 3
    <2b6>   DW_AT_type        : <0x23a>
 <1><2ba>: Abbrev Number: 14 (DW_TAG_structure_type)
    <2bb>   DW_AT_byte_size   : 16
    <2bc>   DW_AT_decl_file   : 5
    <2bc>   DW_AT_decl_line   : 690
    <2be>   DW_AT_decl_column : 9
    <2be>   DW_AT_sibling     : <0x2f3>
 <2><2c2>: Abbrev Number: 7 (DW_TAG_member)
    <2c3>   DW_AT_name        : CR1
    <2c7>   DW_AT_decl_file   : 5
    <2c7>   DW_AT_decl_line   : 692
    <2c9>   DW_AT_decl_column : 17
    <2c9>   DW_AT_type        : <0xa0>
    <2cd>   DW_AT_data_member_location: 0
 <2><2ce>: Abbrev Number: 2 (DW_TAG_member)
    <2cf>   DW_AT_name        : (indirect string, offset: 0x5b56e): CSR1
    <2d3>   DW_AT_decl_file   : 5
    <2d3>   DW_AT_decl_line   : 693
    <2d5>   DW_AT_decl_column : 17
    <2d5>   DW_AT_type        : <0xa0>
    <2d9>   DW_AT_data_member_location: 4
 <2><2da>: Abbrev Number: 7 (DW_TAG_member)
    <2db>   DW_AT_name        : CR2
    <2df>   DW_AT_decl_file   : 5
    <2df>   DW_AT_decl_line   : 694
    <2e1>   DW_AT_decl_column : 17
    <2e1>   DW_AT_type        : <0xa0>
    <2e5>   DW_AT_data_member_location: 8
 <2><2e6>: Abbrev Number: 2 (DW_TAG_member)
    <2e7>   DW_AT_name        : (indirect string, offset: 0x5b573): CSR2
    <2eb>   DW_AT_decl_file   : 5
    <2eb>   DW_AT_decl_line   : 695
    <2ed>   DW_AT_decl_column : 17
    <2ed>   DW_AT_type        : <0xa0>
    <2f1>   DW_AT_data_member_location: 12
 <2><2f2>: Abbrev Number: 0
 <1><2f3>: Abbrev Number: 15 (DW_TAG_typedef)
    <2f4>   DW_AT_name        : (indirect string, offset: 0xa1c70): PWR_TypeDef
    <2f8>   DW_AT_decl_file   : 5
    <2f8>   DW_AT_decl_line   : 696
    <2fa>   DW_AT_decl_column : 3
    <2fa>   DW_AT_type        : <0x2ba>
 <1><2fe>: Abbrev Number: 14 (DW_TAG_structure_type)
    <2ff>   DW_AT_byte_size   : 148
    <300>   DW_AT_decl_file   : 5
    <300>   DW_AT_decl_line   : 703
    <302>   DW_AT_decl_column : 9
    <302>   DW_AT_sibling     : <0x492>
 <2><306>: Abbrev Number: 7 (DW_TAG_member)
    <307>   DW_AT_name        : CR
    <30a>   DW_AT_decl_file   : 5
    <30a>   DW_AT_decl_line   : 705
    <30c>   DW_AT_decl_column : 17
    <30c>   DW_AT_type        : <0xa0>
    <310>   DW_AT_data_member_location: 0
 <2><311>: Abbrev Number: 2 (DW_TAG_member)
    <312>   DW_AT_name        : (indirect string, offset: 0x9c7d5): PLLCFGR
    <316>   DW_AT_decl_file   : 5
    <316>   DW_AT_decl_line   : 706
    <318>   DW_AT_decl_column : 17
    <318>   DW_AT_type        : <0xa0>
    <31c>   DW_AT_data_member_location: 4
 <2><31d>: Abbrev Number: 2 (DW_TAG_member)
    <31e>   DW_AT_name        : (indirect string, offset: 0x3df36): CFGR
    <322>   DW_AT_decl_file   : 5
    <322>   DW_AT_decl_line   : 707
    <324>   DW_AT_decl_column : 17
    <324>   DW_AT_type        : <0xa0>
    <328>   DW_AT_data_member_location: 8
 <2><329>: Abbrev Number: 7 (DW_TAG_member)
    <32a>   DW_AT_name        : CIR
    <32e>   DW_AT_decl_file   : 5
    <32e>   DW_AT_decl_line   : 708
    <330>   DW_AT_decl_column : 17
    <330>   DW_AT_type        : <0xa0>
    <334>   DW_AT_data_member_location: 12
 <2><335>: Abbrev Number: 2 (DW_TAG_member)
    <336>   DW_AT_name        : (indirect string, offset: 0xb1fec): AHB1RSTR
    <33a>   DW_AT_decl_file   : 5
    <33a>   DW_AT_decl_line   : 709
    <33c>   DW_AT_decl_column : 17
    <33c>   DW_AT_type        : <0xa0>
    <340>   DW_AT_data_member_location: 16
 <2><341>: Abbrev Number: 2 (DW_TAG_member)
    <342>   DW_AT_name        : (indirect string, offset: 0x19f4c): AHB2RSTR
    <346>   DW_AT_decl_file   : 5
    <346>   DW_AT_decl_line   : 710
    <348>   DW_AT_decl_column : 17
    <348>   DW_AT_type        : <0xa0>
    <34c>   DW_AT_data_member_location: 20
 <2><34d>: Abbrev Number: 2 (DW_TAG_member)
    <34e>   DW_AT_name        : (indirect string, offset: 0x6197e): AHB3RSTR
    <352>   DW_AT_decl_file   : 5
    <352>   DW_AT_decl_line   : 711
    <354>   DW_AT_decl_column : 17
    <354>   DW_AT_type        : <0xa0>
    <358>   DW_AT_data_member_location: 24
 <2><359>: Abbrev Number: 2 (DW_TAG_member)
    <35a>   DW_AT_name        : (indirect string, offset: 0xd2eab): RESERVED0
    <35e>   DW_AT_decl_file   : 5
    <35e>   DW_AT_decl_line   : 712
    <360>   DW_AT_decl_column : 17
    <360>   DW_AT_type        : <0x94>
    <364>   DW_AT_data_member_location: 28
 <2><365>: Abbrev Number: 2 (DW_TAG_member)
    <366>   DW_AT_name        : (indirect string, offset: 0x19973): APB1RSTR
    <36a>   DW_AT_decl_file   : 5
    <36a>   DW_AT_decl_line   : 713
    <36c>   DW_AT_decl_column : 17
    <36c>   DW_AT_type        : <0xa0>
    <370>   DW_AT_data_member_location: 32
 <2><371>: Abbrev Number: 2 (DW_TAG_member)
    <372>   DW_AT_name        : (indirect string, offset: 0x61344): APB2RSTR
    <376>   DW_AT_decl_file   : 5
    <376>   DW_AT_decl_line   : 714
    <378>   DW_AT_decl_column : 17
    <378>   DW_AT_type        : <0xa0>
    <37c>   DW_AT_data_member_location: 36
 <2><37d>: Abbrev Number: 2 (DW_TAG_member)
    <37e>   DW_AT_name        : (indirect string, offset: 0xd2eb5): RESERVED1
    <382>   DW_AT_decl_file   : 5
    <382>   DW_AT_decl_line   : 715
    <384>   DW_AT_decl_column : 17
    <384>   DW_AT_type        : <0xa5>
    <388>   DW_AT_data_member_location: 40
 <2><389>: Abbrev Number: 2 (DW_TAG_member)
    <38a>   DW_AT_name        : (indirect string, offset: 0x122c7): AHB1ENR
    <38e>   DW_AT_decl_file   : 5
    <38e>   DW_AT_decl_line   : 716
    <390>   DW_AT_decl_column : 17
    <390>   DW_AT_type        : <0xa0>
    <394>   DW_AT_data_member_location: 48
 <2><395>: Abbrev Number: 2 (DW_TAG_member)
    <396>   DW_AT_name        : (indirect string, offset: 0x3b6fa): AHB2ENR
    <39a>   DW_AT_decl_file   : 5
    <39a>   DW_AT_decl_line   : 717
    <39c>   DW_AT_decl_column : 17
    <39c>   DW_AT_type        : <0xa0>
    <3a0>   DW_AT_data_member_location: 52
 <2><3a1>: Abbrev Number: 2 (DW_TAG_member)
    <3a2>   DW_AT_name        : (indirect string, offset: 0x645e9): AHB3ENR
    <3a6>   DW_AT_decl_file   : 5
    <3a6>   DW_AT_decl_line   : 718
    <3a8>   DW_AT_decl_column : 17
    <3a8>   DW_AT_type        : <0xa0>
    <3ac>   DW_AT_data_member_location: 56
 <2><3ad>: Abbrev Number: 2 (DW_TAG_member)
    <3ae>   DW_AT_name        : (indirect string, offset: 0xd2ebf): RESERVED2
    <3b2>   DW_AT_decl_file   : 5
    <3b2>   DW_AT_decl_line   : 719
    <3b4>   DW_AT_decl_column : 17
    <3b4>   DW_AT_type        : <0x94>
    <3b8>   DW_AT_data_member_location: 60
 <2><3b9>: Abbrev Number: 2 (DW_TAG_member)
    <3ba>   DW_AT_name        : (indirect string, offset: 0x801bc): APB1ENR
    <3be>   DW_AT_decl_file   : 5
    <3be>   DW_AT_decl_line   : 720
    <3c0>   DW_AT_decl_column : 17
    <3c0>   DW_AT_type        : <0xa0>
    <3c4>   DW_AT_data_member_location: 64
 <2><3c5>: Abbrev Number: 2 (DW_TAG_member)
    <3c6>   DW_AT_name        : (indirect string, offset: 0x1af08): APB2ENR
    <3ca>   DW_AT_decl_file   : 5
    <3ca>   DW_AT_decl_line   : 721
    <3cc>   DW_AT_decl_column : 17
    <3cc>   DW_AT_type        : <0xa0>
    <3d0>   DW_AT_data_member_location: 68
 <2><3d1>: Abbrev Number: 2 (DW_TAG_member)
    <3d2>   DW_AT_name        : (indirect string, offset: 0xd2ec9): RESERVED3
    <3d6>   DW_AT_decl_file   : 5
    <3d6>   DW_AT_decl_line   : 722
    <3d8>   DW_AT_decl_column : 17
    <3d8>   DW_AT_type        : <0xa5>
    <3dc>   DW_AT_data_member_location: 72
 <2><3dd>: Abbrev Number: 2 (DW_TAG_member)
    <3de>   DW_AT_name        : (indirect string, offset: 0xb6584): AHB1LPENR
    <3e2>   DW_AT_decl_file   : 5
    <3e2>   DW_AT_decl_line   : 723
    <3e4>   DW_AT_decl_column : 17
    <3e4>   DW_AT_type        : <0xa0>
    <3e8>   DW_AT_data_member_location: 80
 <2><3e9>: Abbrev Number: 2 (DW_TAG_member)
    <3ea>   DW_AT_name        : (indirect string, offset: 0x32093): AHB2LPENR
    <3ee>   DW_AT_decl_file   : 5
    <3ee>   DW_AT_decl_line   : 724
    <3f0>   DW_AT_decl_column : 17
    <3f0>   DW_AT_type        : <0xa0>
    <3f4>   DW_AT_data_member_location: 84
 <2><3f5>: Abbrev Number: 2 (DW_TAG_member)
    <3f6>   DW_AT_name        : (indirect string, offset: 0x9748e): AHB3LPENR
    <3fa>   DW_AT_decl_file   : 5
    <3fa>   DW_AT_decl_line   : 725
    <3fc>   DW_AT_decl_column : 17
    <3fc>   DW_AT_type        : <0xa0>
    <400>   DW_AT_data_member_location: 88
 <2><401>: Abbrev Number: 2 (DW_TAG_member)
    <402>   DW_AT_name        : (indirect string, offset: 0xd2ed3): RESERVED4
    <406>   DW_AT_decl_file   : 5
    <406>   DW_AT_decl_line   : 726
    <408>   DW_AT_decl_column : 17
    <408>   DW_AT_type        : <0x94>
    <40c>   DW_AT_data_member_location: 92
 <2><40d>: Abbrev Number: 2 (DW_TAG_member)
    <40e>   DW_AT_name        : (indirect string, offset: 0xbb9e1): APB1LPENR
    <412>   DW_AT_decl_file   : 5
    <412>   DW_AT_decl_line   : 727
    <414>   DW_AT_decl_column : 17
    <414>   DW_AT_type        : <0xa0>
    <418>   DW_AT_data_member_location: 96
 <2><419>: Abbrev Number: 2 (DW_TAG_member)
    <41a>   DW_AT_name        : (indirect string, offset: 0x257f6): APB2LPENR
    <41e>   DW_AT_decl_file   : 5
    <41e>   DW_AT_decl_line   : 728
    <420>   DW_AT_decl_column : 17
    <420>   DW_AT_type        : <0xa0>
    <424>   DW_AT_data_member_location: 100
 <2><425>: Abbrev Number: 2 (DW_TAG_member)
    <426>   DW_AT_name        : (indirect string, offset: 0xd2edd): RESERVED5
    <42a>   DW_AT_decl_file   : 5
    <42a>   DW_AT_decl_line   : 729
    <42c>   DW_AT_decl_column : 17
    <42c>   DW_AT_type        : <0xa5>
    <430>   DW_AT_data_member_location: 104
 <2><431>: Abbrev Number: 2 (DW_TAG_member)
    <432>   DW_AT_name        : (indirect string, offset: 0x1f755): BDCR
    <436>   DW_AT_decl_file   : 5
    <436>   DW_AT_decl_line   : 730
    <438>   DW_AT_decl_column : 17
    <438>   DW_AT_type        : <0xa0>
    <43c>   DW_AT_data_member_location: 112
 <2><43d>: Abbrev Number: 7 (DW_TAG_member)
    <43e>   DW_AT_name        : CSR
    <442>   DW_AT_decl_file   : 5
    <442>   DW_AT_decl_line   : 731
    <444>   DW_AT_decl_column : 17
    <444>   DW_AT_type        : <0xa0>
    <448>   DW_AT_data_member_location: 116
 <2><449>: Abbrev Number: 2 (DW_TAG_member)
    <44a>   DW_AT_name        : (indirect string, offset: 0xd2ee7): RESERVED6
    <44e>   DW_AT_decl_file   : 5
    <44e>   DW_AT_decl_line   : 732
    <450>   DW_AT_decl_column : 17
    <450>   DW_AT_type        : <0xa5>
    <454>   DW_AT_data_member_location: 120
 <2><455>: Abbrev Number: 2 (DW_TAG_member)
    <456>   DW_AT_name        : (indirect string, offset: 0x761cb): SSCGR
    <45a>   DW_AT_decl_file   : 5
    <45a>   DW_AT_decl_line   : 733
    <45c>   DW_AT_decl_column : 17
    <45c>   DW_AT_type        : <0xa0>
    <460>   DW_AT_data_member_location: 128
 <2><461>: Abbrev Number: 2 (DW_TAG_member)
    <462>   DW_AT_name        : (indirect string, offset: 0x49f62): PLLI2SCFGR
    <466>   DW_AT_decl_file   : 5
    <466>   DW_AT_decl_line   : 734
    <468>   DW_AT_decl_column : 17
    <468>   DW_AT_type        : <0xa0>
    <46c>   DW_AT_data_member_location: 132
 <2><46d>: Abbrev Number: 2 (DW_TAG_member)
    <46e>   DW_AT_name        : (indirect string, offset: 0x3df30): PLLSAICFGR
    <472>   DW_AT_decl_file   : 5
    <472>   DW_AT_decl_line   : 735
    <474>   DW_AT_decl_column : 17
    <474>   DW_AT_type        : <0xa0>
    <478>   DW_AT_data_member_location: 136
 <2><479>: Abbrev Number: 2 (DW_TAG_member)
    <47a>   DW_AT_name        : (indirect string, offset: 0x70ef5): DCKCFGR1
    <47e>   DW_AT_decl_file   : 5
    <47e>   DW_AT_decl_line   : 736
    <480>   DW_AT_decl_column : 17
    <480>   DW_AT_type        : <0xa0>
    <484>   DW_AT_data_member_location: 140
 <2><485>: Abbrev Number: 2 (DW_TAG_member)
    <486>   DW_AT_name        : (indirect string, offset: 0x9b23c): DCKCFGR2
    <48a>   DW_AT_decl_file   : 5
    <48a>   DW_AT_decl_line   : 737
    <48c>   DW_AT_decl_column : 17
    <48c>   DW_AT_type        : <0xa0>
    <490>   DW_AT_data_member_location: 144
 <2><491>: Abbrev Number: 0
 <1><492>: Abbrev Number: 15 (DW_TAG_typedef)
    <493>   DW_AT_name        : (indirect string, offset: 0x677b4): RCC_TypeDef
    <497>   DW_AT_decl_file   : 5
    <497>   DW_AT_decl_line   : 739
    <499>   DW_AT_decl_column : 3
    <499>   DW_AT_type        : <0x2fe>
 <1><49d>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <49e>   DW_AT_encoding    : 7	(unsigned)
    <49e>   DW_AT_byte_size   : 1
    <49e>   DW_AT_type        : <0x31>
    <4a2>   DW_AT_decl_file   : 6
    <4a3>   DW_AT_decl_line   : 162
    <4a4>   DW_AT_decl_column : 1
    <4a4>   DW_AT_sibling     : <0x4b5>
 <2><4a8>: Abbrev Number: 4 (DW_TAG_enumerator)
    <4a9>   DW_AT_name        : (indirect string, offset: 0x2a403): DISABLE
    <4ad>   DW_AT_const_value : 0
 <2><4ae>: Abbrev Number: 4 (DW_TAG_enumerator)
    <4af>   DW_AT_name        : (indirect string, offset: 0x76ea4): ENABLE
    <4b3>   DW_AT_const_value : 1
 <2><4b4>: Abbrev Number: 0
 <1><4b5>: Abbrev Number: 3 (DW_TAG_typedef)
    <4b6>   DW_AT_name        : (indirect string, offset: 0x1f6e1): FunctionalState
    <4ba>   DW_AT_decl_file   : 6
    <4bb>   DW_AT_decl_line   : 165
    <4bc>   DW_AT_decl_column : 3
    <4bd>   DW_AT_type        : <0x49d>
 <1><4c1>: Abbrev Number: 6 (DW_TAG_base_type)
    <4c2>   DW_AT_byte_size   : 8
    <4c3>   DW_AT_encoding    : 4	(float)
    <4c4>   DW_AT_name        : (indirect string, offset: 0xe0a34): long double
 <1><4c8>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <4c9>   DW_AT_encoding    : 7	(unsigned)
    <4c9>   DW_AT_byte_size   : 1
    <4c9>   DW_AT_type        : <0x31>
    <4cd>   DW_AT_decl_file   : 7
    <4ce>   DW_AT_decl_line   : 39
    <4cf>   DW_AT_decl_column : 1
    <4cf>   DW_AT_sibling     : <0x4ec>
 <2><4d3>: Abbrev Number: 4 (DW_TAG_enumerator)
    <4d4>   DW_AT_name        : (indirect string, offset: 0x4b23e): HAL_OK
    <4d8>   DW_AT_const_value : 0
 <2><4d9>: Abbrev Number: 4 (DW_TAG_enumerator)
    <4da>   DW_AT_name        : (indirect string, offset: 0x8ad1f): HAL_ERROR
    <4de>   DW_AT_const_value : 1
 <2><4df>: Abbrev Number: 4 (DW_TAG_enumerator)
    <4e0>   DW_AT_name        : (indirect string, offset: 0x27a80): HAL_BUSY
    <4e4>   DW_AT_const_value : 2
 <2><4e5>: Abbrev Number: 4 (DW_TAG_enumerator)
    <4e6>   DW_AT_name        : (indirect string, offset: 0x41947): HAL_TIMEOUT
    <4ea>   DW_AT_const_value : 3
 <2><4eb>: Abbrev Number: 0
 <1><4ec>: Abbrev Number: 3 (DW_TAG_typedef)
    <4ed>   DW_AT_name        : (indirect string, offset: 0x2870): HAL_StatusTypeDef
    <4f1>   DW_AT_decl_file   : 7
    <4f2>   DW_AT_decl_line   : 44
    <4f3>   DW_AT_decl_column : 3
    <4f4>   DW_AT_type        : <0x4c8>
 <1><4f8>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <4f9>   DW_AT_encoding    : 7	(unsigned)
    <4f9>   DW_AT_byte_size   : 1
    <4f9>   DW_AT_type        : <0x31>
    <4fd>   DW_AT_decl_file   : 7
    <4fe>   DW_AT_decl_line   : 50
    <4ff>   DW_AT_decl_column : 1
    <4ff>   DW_AT_sibling     : <0x510>
 <2><503>: Abbrev Number: 4 (DW_TAG_enumerator)
    <504>   DW_AT_name        : (indirect string, offset: 0xa591f): HAL_UNLOCKED
    <508>   DW_AT_const_value : 0
 <2><509>: Abbrev Number: 4 (DW_TAG_enumerator)
    <50a>   DW_AT_name        : (indirect string, offset: 0xdf882): HAL_LOCKED
    <50e>   DW_AT_const_value : 1
 <2><50f>: Abbrev Number: 0
 <1><510>: Abbrev Number: 3 (DW_TAG_typedef)
    <511>   DW_AT_name        : (indirect string, offset: 0x838ee): HAL_LockTypeDef
    <515>   DW_AT_decl_file   : 7
    <516>   DW_AT_decl_line   : 53
    <517>   DW_AT_decl_column : 3
    <518>   DW_AT_type        : <0x4f8>
 <1><51c>: Abbrev Number: 9 (DW_TAG_structure_type)
    <51d>   DW_AT_byte_size   : 24
    <51e>   DW_AT_decl_file   : 8
    <51f>   DW_AT_decl_line   : 45
    <520>   DW_AT_decl_column : 9
    <520>   DW_AT_sibling     : <0x573>
 <2><524>: Abbrev Number: 1 (DW_TAG_member)
    <525>   DW_AT_name        : (indirect string, offset: 0x9614d): PLLState
    <529>   DW_AT_decl_file   : 8
    <52a>   DW_AT_decl_line   : 47
    <52b>   DW_AT_decl_column : 12
    <52c>   DW_AT_type        : <0x94>
    <530>   DW_AT_data_member_location: 0
 <2><531>: Abbrev Number: 1 (DW_TAG_member)
    <532>   DW_AT_name        : (indirect string, offset: 0x9b41b): PLLSource
    <536>   DW_AT_decl_file   : 8
    <537>   DW_AT_decl_line   : 50
    <538>   DW_AT_decl_column : 12
    <539>   DW_AT_type        : <0x94>
    <53d>   DW_AT_data_member_location: 4
 <2><53e>: Abbrev Number: 1 (DW_TAG_member)
    <53f>   DW_AT_name        : (indirect string, offset: 0xb9139): PLLM
    <543>   DW_AT_decl_file   : 8
    <544>   DW_AT_decl_line   : 53
    <545>   DW_AT_decl_column : 12
    <546>   DW_AT_type        : <0x94>
    <54a>   DW_AT_data_member_location: 8
 <2><54b>: Abbrev Number: 1 (DW_TAG_member)
    <54c>   DW_AT_name        : (indirect string, offset: 0xb913e): PLLN
    <550>   DW_AT_decl_file   : 8
    <551>   DW_AT_decl_line   : 56
    <552>   DW_AT_decl_column : 12
    <553>   DW_AT_type        : <0x94>
    <557>   DW_AT_data_member_location: 12
 <2><558>: Abbrev Number: 1 (DW_TAG_member)
    <559>   DW_AT_name        : (indirect string, offset: 0xb915b): PLLP
    <55d>   DW_AT_decl_file   : 8
    <55e>   DW_AT_decl_line   : 59
    <55f>   DW_AT_decl_column : 12
    <560>   DW_AT_type        : <0x94>
    <564>   DW_AT_data_member_location: 16
 <2><565>: Abbrev Number: 1 (DW_TAG_member)
    <566>   DW_AT_name        : (indirect string, offset: 0x60af8): PLLQ
    <56a>   DW_AT_decl_file   : 8
    <56b>   DW_AT_decl_line   : 62
    <56c>   DW_AT_decl_column : 12
    <56d>   DW_AT_type        : <0x94>
    <571>   DW_AT_data_member_location: 20
 <2><572>: Abbrev Number: 0
 <1><573>: Abbrev Number: 3 (DW_TAG_typedef)
    <574>   DW_AT_name        : (indirect string, offset: 0x86769): RCC_PLLInitTypeDef
    <578>   DW_AT_decl_file   : 8
    <579>   DW_AT_decl_line   : 69
    <57a>   DW_AT_decl_column : 2
    <57b>   DW_AT_type        : <0x51c>
 <1><57f>: Abbrev Number: 9 (DW_TAG_structure_type)
    <580>   DW_AT_byte_size   : 48
    <581>   DW_AT_decl_file   : 9
    <582>   DW_AT_decl_line   : 50
    <583>   DW_AT_decl_column : 9
    <583>   DW_AT_sibling     : <0x5e3>
 <2><587>: Abbrev Number: 1 (DW_TAG_member)
    <588>   DW_AT_name        : (indirect string, offset: 0xb5e14): OscillatorType
    <58c>   DW_AT_decl_file   : 9
    <58d>   DW_AT_decl_line   : 52
    <58e>   DW_AT_decl_column : 12
    <58f>   DW_AT_type        : <0x94>
    <593>   DW_AT_data_member_location: 0
 <2><594>: Abbrev Number: 1 (DW_TAG_member)
    <595>   DW_AT_name        : (indirect string, offset: 0x97dd0): HSEState
    <599>   DW_AT_decl_file   : 9
    <59a>   DW_AT_decl_line   : 55
    <59b>   DW_AT_decl_column : 12
    <59c>   DW_AT_type        : <0x94>
    <5a0>   DW_AT_data_member_location: 4
 <2><5a1>: Abbrev Number: 1 (DW_TAG_member)
    <5a2>   DW_AT_name        : (indirect string, offset: 0x8b92c): LSEState
    <5a6>   DW_AT_decl_file   : 9
    <5a7>   DW_AT_decl_line   : 58
    <5a8>   DW_AT_decl_column : 12
    <5a9>   DW_AT_type        : <0x94>
    <5ad>   DW_AT_data_member_location: 8
 <2><5ae>: Abbrev Number: 1 (DW_TAG_member)
    <5af>   DW_AT_name        : (indirect string, offset: 0x63c5b): HSIState
    <5b3>   DW_AT_decl_file   : 9
    <5b4>   DW_AT_decl_line   : 61
    <5b5>   DW_AT_decl_column : 12
    <5b6>   DW_AT_type        : <0x94>
    <5ba>   DW_AT_data_member_location: 12
 <2><5bb>: Abbrev Number: 1 (DW_TAG_member)
    <5bc>   DW_AT_name        : (indirect string, offset: 0xc0774): HSICalibrationValue
    <5c0>   DW_AT_decl_file   : 9
    <5c1>   DW_AT_decl_line   : 64
    <5c2>   DW_AT_decl_column : 12
    <5c3>   DW_AT_type        : <0x94>
    <5c7>   DW_AT_data_member_location: 16
 <2><5c8>: Abbrev Number: 1 (DW_TAG_member)
    <5c9>   DW_AT_name        : (indirect string, offset: 0x4e1f2): LSIState
    <5cd>   DW_AT_decl_file   : 9
    <5ce>   DW_AT_decl_line   : 67
    <5cf>   DW_AT_decl_column : 12
    <5d0>   DW_AT_type        : <0x94>
    <5d4>   DW_AT_data_member_location: 20
 <2><5d5>: Abbrev Number: 10 (DW_TAG_member)
    <5d6>   DW_AT_name        : PLL
    <5da>   DW_AT_decl_file   : 9
    <5db>   DW_AT_decl_line   : 70
    <5dc>   DW_AT_decl_column : 22
    <5dd>   DW_AT_type        : <0x573>
    <5e1>   DW_AT_data_member_location: 24
 <2><5e2>: Abbrev Number: 0
 <1><5e3>: Abbrev Number: 3 (DW_TAG_typedef)
    <5e4>   DW_AT_name        : (indirect string, offset: 0x76661): RCC_OscInitTypeDef
    <5e8>   DW_AT_decl_file   : 9
    <5e9>   DW_AT_decl_line   : 72
    <5ea>   DW_AT_decl_column : 2
    <5eb>   DW_AT_type        : <0x57f>
 <1><5ef>: Abbrev Number: 9 (DW_TAG_structure_type)
    <5f0>   DW_AT_byte_size   : 20
    <5f1>   DW_AT_decl_file   : 9
    <5f2>   DW_AT_decl_line   : 77
    <5f3>   DW_AT_decl_column : 9
    <5f3>   DW_AT_sibling     : <0x639>
 <2><5f7>: Abbrev Number: 1 (DW_TAG_member)
    <5f8>   DW_AT_name        : (indirect string, offset: 0x449bd): ClockType
    <5fc>   DW_AT_decl_file   : 9
    <5fd>   DW_AT_decl_line   : 79
    <5fe>   DW_AT_decl_column : 12
    <5ff>   DW_AT_type        : <0x94>
    <603>   DW_AT_data_member_location: 0
 <2><604>: Abbrev Number: 1 (DW_TAG_member)
    <605>   DW_AT_name        : (indirect string, offset: 0x862f8): SYSCLKSource
    <609>   DW_AT_decl_file   : 9
    <60a>   DW_AT_decl_line   : 82
    <60b>   DW_AT_decl_column : 12
    <60c>   DW_AT_type        : <0x94>
    <610>   DW_AT_data_member_location: 4
 <2><611>: Abbrev Number: 1 (DW_TAG_member)
    <612>   DW_AT_name        : (indirect string, offset: 0xb8aa8): AHBCLKDivider
    <616>   DW_AT_decl_file   : 9
    <617>   DW_AT_decl_line   : 85
    <618>   DW_AT_decl_column : 12
    <619>   DW_AT_type        : <0x94>
    <61d>   DW_AT_data_member_location: 8
 <2><61e>: Abbrev Number: 1 (DW_TAG_member)
    <61f>   DW_AT_name        : (indirect string, offset: 0x8b97): APB1CLKDivider
    <623>   DW_AT_decl_file   : 9
    <624>   DW_AT_decl_line   : 88
    <625>   DW_AT_decl_column : 12
    <626>   DW_AT_type        : <0x94>
    <62a>   DW_AT_data_member_location: 12
 <2><62b>: Abbrev Number: 1 (DW_TAG_member)
    <62c>   DW_AT_name        : (indirect string, offset: 0x66656): APB2CLKDivider
    <630>   DW_AT_decl_file   : 9
    <631>   DW_AT_decl_line   : 91
    <632>   DW_AT_decl_column : 12
    <633>   DW_AT_type        : <0x94>
    <637>   DW_AT_data_member_location: 16
 <2><638>: Abbrev Number: 0
 <1><639>: Abbrev Number: 3 (DW_TAG_typedef)
    <63a>   DW_AT_name        : (indirect string, offset: 0xacb27): RCC_ClkInitTypeDef
    <63e>   DW_AT_decl_file   : 9
    <63f>   DW_AT_decl_line   : 94
    <640>   DW_AT_decl_column : 2
    <641>   DW_AT_type        : <0x5ef>
 <1><645>: Abbrev Number: 9 (DW_TAG_structure_type)
    <646>   DW_AT_byte_size   : 20
    <647>   DW_AT_decl_file   : 10
    <648>   DW_AT_decl_line   : 46
    <649>   DW_AT_decl_column : 9
    <649>   DW_AT_sibling     : <0x68f>
 <2><64d>: Abbrev Number: 10 (DW_TAG_member)
    <64e>   DW_AT_name        : Pin
    <652>   DW_AT_decl_file   : 10
    <653>   DW_AT_decl_line   : 48
    <654>   DW_AT_decl_column : 12
    <655>   DW_AT_type        : <0x94>
    <659>   DW_AT_data_member_location: 0
 <2><65a>: Abbrev Number: 1 (DW_TAG_member)
    <65b>   DW_AT_name        : (indirect string, offset: 0x60cb0): Mode
    <65f>   DW_AT_decl_file   : 10
    <660>   DW_AT_decl_line   : 51
    <661>   DW_AT_decl_column : 12
    <662>   DW_AT_type        : <0x94>
    <666>   DW_AT_data_member_location: 4
 <2><667>: Abbrev Number: 1 (DW_TAG_member)
    <668>   DW_AT_name        : (indirect string, offset: 0x72b0c): Pull
    <66c>   DW_AT_decl_file   : 10
    <66d>   DW_AT_decl_line   : 54
    <66e>   DW_AT_decl_column : 12
    <66f>   DW_AT_type        : <0x94>
    <673>   DW_AT_data_member_location: 8
 <2><674>: Abbrev Number: 1 (DW_TAG_member)
    <675>   DW_AT_name        : (indirect string, offset: 0x82b0a): Speed
    <679>   DW_AT_decl_file   : 10
    <67a>   DW_AT_decl_line   : 57
    <67b>   DW_AT_decl_column : 12
    <67c>   DW_AT_type        : <0x94>
    <680>   DW_AT_data_member_location: 12
 <2><681>: Abbrev Number: 1 (DW_TAG_member)
    <682>   DW_AT_name        : (indirect string, offset: 0x66617): Alternate
    <686>   DW_AT_decl_file   : 10
    <687>   DW_AT_decl_line   : 60
    <688>   DW_AT_decl_column : 12
    <689>   DW_AT_type        : <0x94>
    <68d>   DW_AT_data_member_location: 16
 <2><68e>: Abbrev Number: 0
 <1><68f>: Abbrev Number: 3 (DW_TAG_typedef)
    <690>   DW_AT_name        : (indirect string, offset: 0xaf0b4): GPIO_InitTypeDef
    <694>   DW_AT_decl_file   : 10
    <695>   DW_AT_decl_line   : 62
    <696>   DW_AT_decl_column : 2
    <697>   DW_AT_type        : <0x645>
 <1><69b>: Abbrev Number: 9 (DW_TAG_structure_type)
    <69c>   DW_AT_byte_size   : 48
    <69d>   DW_AT_decl_file   : 11
    <69e>   DW_AT_decl_line   : 48
    <69f>   DW_AT_decl_column : 9
    <69f>   DW_AT_sibling     : <0x740>
 <2><6a3>: Abbrev Number: 1 (DW_TAG_member)
    <6a4>   DW_AT_name        : (indirect string, offset: 0x5aaa9): Channel
    <6a8>   DW_AT_decl_file   : 11
    <6a9>   DW_AT_decl_line   : 50
    <6aa>   DW_AT_decl_column : 12
    <6ab>   DW_AT_type        : <0x94>
    <6af>   DW_AT_data_member_location: 0
 <2><6b0>: Abbrev Number: 1 (DW_TAG_member)
    <6b1>   DW_AT_name        : (indirect string, offset: 0x52ff2): Direction
    <6b5>   DW_AT_decl_file   : 11
    <6b6>   DW_AT_decl_line   : 53
    <6b7>   DW_AT_decl_column : 12
    <6b8>   DW_AT_type        : <0x94>
    <6bc>   DW_AT_data_member_location: 4
 <2><6bd>: Abbrev Number: 1 (DW_TAG_member)
    <6be>   DW_AT_name        : (indirect string, offset: 0xecc7): PeriphInc
    <6c2>   DW_AT_decl_file   : 11
    <6c3>   DW_AT_decl_line   : 57
    <6c4>   DW_AT_decl_column : 12
    <6c5>   DW_AT_type        : <0x94>
    <6c9>   DW_AT_data_member_location: 8
 <2><6ca>: Abbrev Number: 1 (DW_TAG_member)
    <6cb>   DW_AT_name        : (indirect string, offset: 0x23a73): MemInc
    <6cf>   DW_AT_decl_file   : 11
    <6d0>   DW_AT_decl_line   : 60
    <6d1>   DW_AT_decl_column : 12
    <6d2>   DW_AT_type        : <0x94>
    <6d6>   DW_AT_data_member_location: 12
 <2><6d7>: Abbrev Number: 1 (DW_TAG_member)
    <6d8>   DW_AT_name        : (indirect string, offset: 0x6ed92): PeriphDataAlignment
    <6dc>   DW_AT_decl_file   : 11
    <6dd>   DW_AT_decl_line   : 63
    <6de>   DW_AT_decl_column : 12
    <6df>   DW_AT_type        : <0x94>
    <6e3>   DW_AT_data_member_location: 16
 <2><6e4>: Abbrev Number: 1 (DW_TAG_member)
    <6e5>   DW_AT_name        : (indirect string, offset: 0xca3bc): MemDataAlignment
    <6e9>   DW_AT_decl_file   : 11
    <6ea>   DW_AT_decl_line   : 66
    <6eb>   DW_AT_decl_column : 12
    <6ec>   DW_AT_type        : <0x94>
    <6f0>   DW_AT_data_member_location: 20
 <2><6f1>: Abbrev Number: 1 (DW_TAG_member)
    <6f2>   DW_AT_name        : (indirect string, offset: 0x60cb0): Mode
    <6f6>   DW_AT_decl_file   : 11
    <6f7>   DW_AT_decl_line   : 69
    <6f8>   DW_AT_decl_column : 12
    <6f9>   DW_AT_type        : <0x94>
    <6fd>   DW_AT_data_member_location: 24
 <2><6fe>: Abbrev Number: 1 (DW_TAG_member)
    <6ff>   DW_AT_name        : (indirect string, offset: 0xe7072): Priority
    <703>   DW_AT_decl_file   : 11
    <704>   DW_AT_decl_line   : 74
    <705>   DW_AT_decl_column : 12
    <706>   DW_AT_type        : <0x94>
    <70a>   DW_AT_data_member_location: 28
 <2><70b>: Abbrev Number: 1 (DW_TAG_member)
    <70c>   DW_AT_name        : (indirect string, offset: 0x60cac): FIFOMode
    <710>   DW_AT_decl_file   : 11
    <711>   DW_AT_decl_line   : 77
    <712>   DW_AT_decl_column : 12
    <713>   DW_AT_type        : <0x94>
    <717>   DW_AT_data_member_location: 32
 <2><718>: Abbrev Number: 1 (DW_TAG_member)
    <719>   DW_AT_name        : (indirect string, offset: 0xaa12a): FIFOThreshold
    <71d>   DW_AT_decl_file   : 11
    <71e>   DW_AT_decl_line   : 82
    <71f>   DW_AT_decl_column : 12
    <720>   DW_AT_type        : <0x94>
    <724>   DW_AT_data_member_location: 36
 <2><725>: Abbrev Number: 1 (DW_TAG_member)
    <726>   DW_AT_name        : (indirect string, offset: 0xa7e01): MemBurst
    <72a>   DW_AT_decl_file   : 11
    <72b>   DW_AT_decl_line   : 85
    <72c>   DW_AT_decl_column : 12
    <72d>   DW_AT_type        : <0x94>
    <731>   DW_AT_data_member_location: 40
 <2><732>: Abbrev Number: 1 (DW_TAG_member)
    <733>   DW_AT_name        : (indirect string, offset: 0x4c70f): PeriphBurst
    <737>   DW_AT_decl_file   : 11
    <738>   DW_AT_decl_line   : 91
    <739>   DW_AT_decl_column : 12
    <73a>   DW_AT_type        : <0x94>
    <73e>   DW_AT_data_member_location: 44
 <2><73f>: Abbrev Number: 0
 <1><740>: Abbrev Number: 3 (DW_TAG_typedef)
    <741>   DW_AT_name        : (indirect string, offset: 0x3c3f1): DMA_InitTypeDef
    <745>   DW_AT_decl_file   : 11
    <746>   DW_AT_decl_line   : 96
    <747>   DW_AT_decl_column : 2
    <748>   DW_AT_type        : <0x69b>
 <1><74c>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <74d>   DW_AT_encoding    : 7	(unsigned)
    <74d>   DW_AT_byte_size   : 1
    <74d>   DW_AT_type        : <0x31>
    <751>   DW_AT_decl_file   : 11
    <752>   DW_AT_decl_line   : 102
    <753>   DW_AT_decl_column : 1
    <753>   DW_AT_sibling     : <0x77c>
 <2><757>: Abbrev Number: 4 (DW_TAG_enumerator)
    <758>   DW_AT_name        : (indirect string, offset: 0xa6c25): HAL_DMA_STATE_RESET
    <75c>   DW_AT_const_value : 0
 <2><75d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <75e>   DW_AT_name        : (indirect string, offset: 0x3d8d5): HAL_DMA_STATE_READY
    <762>   DW_AT_const_value : 1
 <2><763>: Abbrev Number: 4 (DW_TAG_enumerator)
    <764>   DW_AT_name        : (indirect string, offset: 0x9ada3): HAL_DMA_STATE_BUSY
    <768>   DW_AT_const_value : 2
 <2><769>: Abbrev Number: 4 (DW_TAG_enumerator)
    <76a>   DW_AT_name        : (indirect string, offset: 0xdc35b): HAL_DMA_STATE_TIMEOUT
    <76e>   DW_AT_const_value : 3
 <2><76f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <770>   DW_AT_name        : (indirect string, offset: 0xbfaad): HAL_DMA_STATE_ERROR
    <774>   DW_AT_const_value : 4
 <2><775>: Abbrev Number: 4 (DW_TAG_enumerator)
    <776>   DW_AT_name        : (indirect string, offset: 0x32d40): HAL_DMA_STATE_ABORT
    <77a>   DW_AT_const_value : 5
 <2><77b>: Abbrev Number: 0
 <1><77c>: Abbrev Number: 3 (DW_TAG_typedef)
    <77d>   DW_AT_name        : (indirect string, offset: 0x7abbe): HAL_DMA_StateTypeDef
    <781>   DW_AT_decl_file   : 11
    <782>   DW_AT_decl_line   : 109
    <783>   DW_AT_decl_column : 2
    <784>   DW_AT_type        : <0x74c>
 <1><788>: Abbrev Number: 17 (DW_TAG_volatile_type)
    <789>   DW_AT_type        : <0x77c>
 <1><78d>: Abbrev Number: 25 (DW_TAG_structure_type)
    <78e>   DW_AT_name        : (indirect string, offset: 0xbe9d1): __DMA_HandleTypeDef
    <792>   DW_AT_byte_size   : 96
    <793>   DW_AT_decl_file   : 11
    <794>   DW_AT_decl_line   : 137
    <795>   DW_AT_decl_column : 16
    <796>   DW_AT_sibling     : <0x851>
 <2><79a>: Abbrev Number: 1 (DW_TAG_member)
    <79b>   DW_AT_name        : (indirect string, offset: 0xd8109): Instance
    <79f>   DW_AT_decl_file   : 11
    <7a0>   DW_AT_decl_line   : 139
    <7a1>   DW_AT_decl_column : 31
    <7a2>   DW_AT_type        : <0x851>
    <7a6>   DW_AT_data_member_location: 0
 <2><7a7>: Abbrev Number: 1 (DW_TAG_member)
    <7a8>   DW_AT_name        : (indirect string, offset: 0x3fc94): Init
    <7ac>   DW_AT_decl_file   : 11
    <7ad>   DW_AT_decl_line   : 141
    <7ae>   DW_AT_decl_column : 30
    <7af>   DW_AT_type        : <0x740>
    <7b3>   DW_AT_data_member_location: 4
 <2><7b4>: Abbrev Number: 1 (DW_TAG_member)
    <7b5>   DW_AT_name        : (indirect string, offset: 0x9f619): Lock
    <7b9>   DW_AT_decl_file   : 11
    <7ba>   DW_AT_decl_line   : 143
    <7bb>   DW_AT_decl_column : 30
    <7bc>   DW_AT_type        : <0x510>
    <7c0>   DW_AT_data_member_location: 52
 <2><7c1>: Abbrev Number: 1 (DW_TAG_member)
    <7c2>   DW_AT_name        : (indirect string, offset: 0x97dd3): State
    <7c6>   DW_AT_decl_file   : 11
    <7c7>   DW_AT_decl_line   : 145
    <7c8>   DW_AT_decl_column : 30
    <7c9>   DW_AT_type        : <0x788>
    <7cd>   DW_AT_data_member_location: 53
 <2><7ce>: Abbrev Number: 1 (DW_TAG_member)
    <7cf>   DW_AT_name        : (indirect string, offset: 0xd4c37): Parent
    <7d3>   DW_AT_decl_file   : 11
    <7d4>   DW_AT_decl_line   : 147
    <7d5>   DW_AT_decl_column : 31
    <7d6>   DW_AT_type        : <0x856>
    <7da>   DW_AT_data_member_location: 56
 <2><7db>: Abbrev Number: 1 (DW_TAG_member)
    <7dc>   DW_AT_name        : (indirect string, offset: 0xdec2d): XferCpltCallback
    <7e0>   DW_AT_decl_file   : 11
    <7e1>   DW_AT_decl_line   : 149
    <7e2>   DW_AT_decl_column : 33
    <7e3>   DW_AT_type        : <0x868>
    <7e7>   DW_AT_data_member_location: 60
 <2><7e8>: Abbrev Number: 1 (DW_TAG_member)
    <7e9>   DW_AT_name        : (indirect string, offset: 0xaded4): XferHalfCpltCallback
    <7ed>   DW_AT_decl_file   : 11
    <7ee>   DW_AT_decl_line   : 151
    <7ef>   DW_AT_decl_column : 33
    <7f0>   DW_AT_type        : <0x868>
    <7f4>   DW_AT_data_member_location: 64
 <2><7f5>: Abbrev Number: 1 (DW_TAG_member)
    <7f6>   DW_AT_name        : (indirect string, offset: 0x82d39): XferM1CpltCallback
    <7fa>   DW_AT_decl_file   : 11
    <7fb>   DW_AT_decl_line   : 153
    <7fc>   DW_AT_decl_column : 33
    <7fd>   DW_AT_type        : <0x868>
    <801>   DW_AT_data_member_location: 68
 <2><802>: Abbrev Number: 1 (DW_TAG_member)
    <803>   DW_AT_name        : (indirect string, offset: 0x6b7f5): XferM1HalfCpltCallback
    <807>   DW_AT_decl_file   : 11
    <808>   DW_AT_decl_line   : 155
    <809>   DW_AT_decl_column : 33
    <80a>   DW_AT_type        : <0x868>
    <80e>   DW_AT_data_member_location: 72
 <2><80f>: Abbrev Number: 1 (DW_TAG_member)
    <810>   DW_AT_name        : (indirect string, offset: 0x2073e): XferErrorCallback
    <814>   DW_AT_decl_file   : 11
    <815>   DW_AT_decl_line   : 157
    <816>   DW_AT_decl_column : 33
    <817>   DW_AT_type        : <0x868>
    <81b>   DW_AT_data_member_location: 76
 <2><81c>: Abbrev Number: 1 (DW_TAG_member)
    <81d>   DW_AT_name        : (indirect string, offset: 0xd0d84): XferAbortCallback
    <821>   DW_AT_decl_file   : 11
    <822>   DW_AT_decl_line   : 159
    <823>   DW_AT_decl_column : 33
    <824>   DW_AT_type        : <0x868>
    <828>   DW_AT_data_member_location: 80
 <2><829>: Abbrev Number: 1 (DW_TAG_member)
    <82a>   DW_AT_name        : (indirect string, offset: 0xda622): ErrorCode
    <82e>   DW_AT_decl_file   : 11
    <82f>   DW_AT_decl_line   : 161
    <830>   DW_AT_decl_column : 30
    <831>   DW_AT_type        : <0xa0>
    <835>   DW_AT_data_member_location: 84
 <2><836>: Abbrev Number: 1 (DW_TAG_member)
    <837>   DW_AT_name        : (indirect string, offset: 0x6403b): StreamBaseAddress
    <83b>   DW_AT_decl_file   : 11
    <83c>   DW_AT_decl_line   : 163
    <83d>   DW_AT_decl_column : 30
    <83e>   DW_AT_type        : <0x94>
    <842>   DW_AT_data_member_location: 88
 <2><843>: Abbrev Number: 1 (DW_TAG_member)
    <844>   DW_AT_name        : (indirect string, offset: 0xbbd30): StreamIndex
    <848>   DW_AT_decl_file   : 11
    <849>   DW_AT_decl_line   : 165
    <84a>   DW_AT_decl_column : 30
    <84b>   DW_AT_type        : <0x94>
    <84f>   DW_AT_data_member_location: 92
 <2><850>: Abbrev Number: 0
 <1><851>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <852>   DW_AT_byte_size   : 4
    <852>   DW_AT_type        : <0x21b>
 <1><856>: Abbrev Number: 26 (DW_TAG_pointer_type)
    <857>   DW_AT_byte_size   : 4
 <1><858>: Abbrev Number: 27 (DW_TAG_subroutine_type)
    <859>   DW_AT_prototyped  : 1
    <859>   DW_AT_sibling     : <0x863>
 <2><85d>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <85e>   DW_AT_type        : <0x863>
 <2><862>: Abbrev Number: 0
 <1><863>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <864>   DW_AT_byte_size   : 4
    <864>   DW_AT_type        : <0x78d>
 <1><868>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <869>   DW_AT_byte_size   : 4
    <869>   DW_AT_type        : <0x858>
 <1><86d>: Abbrev Number: 3 (DW_TAG_typedef)
    <86e>   DW_AT_name        : (indirect string, offset: 0xbe9d3): DMA_HandleTypeDef
    <872>   DW_AT_decl_file   : 11
    <873>   DW_AT_decl_line   : 167
    <874>   DW_AT_decl_column : 2
    <875>   DW_AT_type        : <0x78d>
 <1><879>: Abbrev Number: 9 (DW_TAG_structure_type)
    <87a>   DW_AT_byte_size   : 48
    <87b>   DW_AT_decl_file   : 12
    <87c>   DW_AT_decl_line   : 56
    <87d>   DW_AT_decl_column : 9
    <87d>   DW_AT_sibling     : <0x91e>
 <2><881>: Abbrev Number: 1 (DW_TAG_member)
    <882>   DW_AT_name        : (indirect string, offset: 0xc5147): ClockPrescaler
    <886>   DW_AT_decl_file   : 12
    <887>   DW_AT_decl_line   : 58
    <888>   DW_AT_decl_column : 12
    <889>   DW_AT_type        : <0x94>
    <88d>   DW_AT_data_member_location: 0
 <2><88e>: Abbrev Number: 1 (DW_TAG_member)
    <88f>   DW_AT_name        : (indirect string, offset: 0x12082): Resolution
    <893>   DW_AT_decl_file   : 12
    <894>   DW_AT_decl_line   : 61
    <895>   DW_AT_decl_column : 12
    <896>   DW_AT_type        : <0x94>
    <89a>   DW_AT_data_member_location: 4
 <2><89b>: Abbrev Number: 1 (DW_TAG_member)
    <89c>   DW_AT_name        : (indirect string, offset: 0x30e9f): DataAlign
    <8a0>   DW_AT_decl_file   : 12
    <8a1>   DW_AT_decl_line   : 63
    <8a2>   DW_AT_decl_column : 12
    <8a3>   DW_AT_type        : <0x94>
    <8a7>   DW_AT_data_member_location: 8
 <2><8a8>: Abbrev Number: 1 (DW_TAG_member)
    <8a9>   DW_AT_name        : (indirect string, offset: 0xd02f2): ScanConvMode
    <8ad>   DW_AT_decl_file   : 12
    <8ae>   DW_AT_decl_line   : 66
    <8af>   DW_AT_decl_column : 12
    <8b0>   DW_AT_type        : <0x94>
    <8b4>   DW_AT_data_member_location: 12
 <2><8b5>: Abbrev Number: 1 (DW_TAG_member)
    <8b6>   DW_AT_name        : (indirect string, offset: 0x8590): EOCSelection
    <8ba>   DW_AT_decl_file   : 12
    <8bb>   DW_AT_decl_line   : 74
    <8bc>   DW_AT_decl_column : 12
    <8bd>   DW_AT_type        : <0x94>
    <8c1>   DW_AT_data_member_location: 16
 <2><8c2>: Abbrev Number: 1 (DW_TAG_member)
    <8c3>   DW_AT_name        : (indirect string, offset: 0x5e1f6): ContinuousConvMode
    <8c7>   DW_AT_decl_file   : 12
    <8c8>   DW_AT_decl_line   : 81
    <8c9>   DW_AT_decl_column : 12
    <8ca>   DW_AT_type        : <0x94>
    <8ce>   DW_AT_data_member_location: 20
 <2><8cf>: Abbrev Number: 1 (DW_TAG_member)
    <8d0>   DW_AT_name        : (indirect string, offset: 0x856d8): NbrOfConversion
    <8d4>   DW_AT_decl_file   : 12
    <8d5>   DW_AT_decl_line   : 84
    <8d6>   DW_AT_decl_column : 12
    <8d7>   DW_AT_type        : <0x94>
    <8db>   DW_AT_data_member_location: 24
 <2><8dc>: Abbrev Number: 1 (DW_TAG_member)
    <8dd>   DW_AT_name        : (indirect string, offset: 0x74285): DiscontinuousConvMode
    <8e1>   DW_AT_decl_file   : 12
    <8e2>   DW_AT_decl_line   : 87
    <8e3>   DW_AT_decl_column : 19
    <8e4>   DW_AT_type        : <0x4b5>
    <8e8>   DW_AT_data_member_location: 28
 <2><8e9>: Abbrev Number: 1 (DW_TAG_member)
    <8ea>   DW_AT_name        : (indirect string, offset: 0x2053c): NbrOfDiscConversion
    <8ee>   DW_AT_decl_file   : 12
    <8ef>   DW_AT_decl_line   : 91
    <8f0>   DW_AT_decl_column : 12
    <8f1>   DW_AT_type        : <0x94>
    <8f5>   DW_AT_data_member_location: 32
 <2><8f6>: Abbrev Number: 1 (DW_TAG_member)
    <8f7>   DW_AT_name        : (indirect string, offset: 0xa67c2): ExternalTrigConv
    <8fb>   DW_AT_decl_file   : 12
    <8fc>   DW_AT_decl_line   : 94
    <8fd>   DW_AT_decl_column : 12
    <8fe>   DW_AT_type        : <0x94>
    <902>   DW_AT_data_member_location: 36
 <2><903>: Abbrev Number: 1 (DW_TAG_member)
    <904>   DW_AT_name        : (indirect string, offset: 0x3d2f7): ExternalTrigConvEdge
    <908>   DW_AT_decl_file   : 12
    <909>   DW_AT_decl_line   : 98
    <90a>   DW_AT_decl_column : 12
    <90b>   DW_AT_type        : <0x94>
    <90f>   DW_AT_data_member_location: 40
 <2><910>: Abbrev Number: 1 (DW_TAG_member)
    <911>   DW_AT_name        : (indirect string, offset: 0xba41): DMAContinuousRequests
    <915>   DW_AT_decl_file   : 12
    <916>   DW_AT_decl_line   : 101
    <917>   DW_AT_decl_column : 19
    <918>   DW_AT_type        : <0x4b5>
    <91c>   DW_AT_data_member_location: 44
 <2><91d>: Abbrev Number: 0
 <1><91e>: Abbrev Number: 3 (DW_TAG_typedef)
    <91f>   DW_AT_name        : (indirect string, offset: 0x345d9): ADC_InitTypeDef
    <923>   DW_AT_decl_file   : 12
    <924>   DW_AT_decl_line   : 106
    <925>   DW_AT_decl_column : 2
    <926>   DW_AT_type        : <0x879>
 <1><92a>: Abbrev Number: 9 (DW_TAG_structure_type)
    <92b>   DW_AT_byte_size   : 16
    <92c>   DW_AT_decl_file   : 12
    <92d>   DW_AT_decl_line   : 115
    <92e>   DW_AT_decl_column : 9
    <92e>   DW_AT_sibling     : <0x967>
 <2><932>: Abbrev Number: 1 (DW_TAG_member)
    <933>   DW_AT_name        : (indirect string, offset: 0x5aaa9): Channel
    <937>   DW_AT_decl_file   : 12
    <938>   DW_AT_decl_line   : 117
    <939>   DW_AT_decl_column : 12
    <93a>   DW_AT_type        : <0x94>
    <93e>   DW_AT_data_member_location: 0
 <2><93f>: Abbrev Number: 1 (DW_TAG_member)
    <940>   DW_AT_name        : (indirect string, offset: 0x39a11): Rank
    <944>   DW_AT_decl_file   : 12
    <945>   DW_AT_decl_line   : 119
    <946>   DW_AT_decl_column : 12
    <947>   DW_AT_type        : <0x94>
    <94b>   DW_AT_data_member_location: 4
 <2><94c>: Abbrev Number: 1 (DW_TAG_member)
    <94d>   DW_AT_name        : (indirect string, offset: 0x908bb): SamplingTime
    <951>   DW_AT_decl_file   : 12
    <952>   DW_AT_decl_line   : 122
    <953>   DW_AT_decl_column : 12
    <954>   DW_AT_type        : <0x94>
    <958>   DW_AT_data_member_location: 8
 <2><959>: Abbrev Number: 1 (DW_TAG_member)
    <95a>   DW_AT_name        : (indirect string, offset: 0xb0f88): Offset
    <95e>   DW_AT_decl_file   : 12
    <95f>   DW_AT_decl_line   : 131
    <960>   DW_AT_decl_column : 12
    <961>   DW_AT_type        : <0x94>
    <965>   DW_AT_data_member_location: 12
 <2><966>: Abbrev Number: 0
 <1><967>: Abbrev Number: 3 (DW_TAG_typedef)
    <968>   DW_AT_name        : (indirect string, offset: 0xdf20e): ADC_ChannelConfTypeDef
    <96c>   DW_AT_decl_file   : 12
    <96d>   DW_AT_decl_line   : 132
    <96e>   DW_AT_decl_column : 2
    <96f>   DW_AT_type        : <0x92a>
 <1><973>: Abbrev Number: 9 (DW_TAG_structure_type)
    <974>   DW_AT_byte_size   : 72
    <975>   DW_AT_decl_file   : 12
    <976>   DW_AT_decl_line   : 194
    <977>   DW_AT_decl_column : 9
    <977>   DW_AT_sibling     : <0x9d7>
 <2><97b>: Abbrev Number: 1 (DW_TAG_member)
    <97c>   DW_AT_name        : (indirect string, offset: 0xd8109): Instance
    <980>   DW_AT_decl_file   : 12
    <981>   DW_AT_decl_line   : 197
    <982>   DW_AT_decl_column : 34
    <983>   DW_AT_type        : <0x9d7>
    <987>   DW_AT_data_member_location: 0
 <2><988>: Abbrev Number: 1 (DW_TAG_member)
    <989>   DW_AT_name        : (indirect string, offset: 0x3fc94): Init
    <98d>   DW_AT_decl_file   : 12
    <98e>   DW_AT_decl_line   : 199
    <98f>   DW_AT_decl_column : 33
    <990>   DW_AT_type        : <0x91e>
    <994>   DW_AT_data_member_location: 4
 <2><995>: Abbrev Number: 1 (DW_TAG_member)
    <996>   DW_AT_name        : (indirect string, offset: 0x399fb): NbrOfCurrentConversionRank
    <99a>   DW_AT_decl_file   : 12
    <99b>   DW_AT_decl_line   : 201
    <99c>   DW_AT_decl_column : 33
    <99d>   DW_AT_type        : <0xa0>
    <9a1>   DW_AT_data_member_location: 52
 <2><9a2>: Abbrev Number: 1 (DW_TAG_member)
    <9a3>   DW_AT_name        : (indirect string, offset: 0x259d): DMA_Handle
    <9a7>   DW_AT_decl_file   : 12
    <9a8>   DW_AT_decl_line   : 203
    <9a9>   DW_AT_decl_column : 34
    <9aa>   DW_AT_type        : <0x9dc>
    <9ae>   DW_AT_data_member_location: 56
 <2><9af>: Abbrev Number: 1 (DW_TAG_member)
    <9b0>   DW_AT_name        : (indirect string, offset: 0x9f619): Lock
    <9b4>   DW_AT_decl_file   : 12
    <9b5>   DW_AT_decl_line   : 205
    <9b6>   DW_AT_decl_column : 33
    <9b7>   DW_AT_type        : <0x510>
    <9bb>   DW_AT_data_member_location: 60
 <2><9bc>: Abbrev Number: 1 (DW_TAG_member)
    <9bd>   DW_AT_name        : (indirect string, offset: 0x97dd3): State
    <9c1>   DW_AT_decl_file   : 12
    <9c2>   DW_AT_decl_line   : 207
    <9c3>   DW_AT_decl_column : 33
    <9c4>   DW_AT_type        : <0xa0>
    <9c8>   DW_AT_data_member_location: 64
 <2><9c9>: Abbrev Number: 1 (DW_TAG_member)
    <9ca>   DW_AT_name        : (indirect string, offset: 0xda622): ErrorCode
    <9ce>   DW_AT_decl_file   : 12
    <9cf>   DW_AT_decl_line   : 209
    <9d0>   DW_AT_decl_column : 33
    <9d1>   DW_AT_type        : <0xa0>
    <9d5>   DW_AT_data_member_location: 68
 <2><9d6>: Abbrev Number: 0
 <1><9d7>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <9d8>   DW_AT_byte_size   : 4
    <9d8>   DW_AT_type        : <0x1bf>
 <1><9dc>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <9dd>   DW_AT_byte_size   : 4
    <9dd>   DW_AT_type        : <0x86d>
 <1><9e1>: Abbrev Number: 3 (DW_TAG_typedef)
    <9e2>   DW_AT_name        : (indirect string, offset: 0x2ce1e): ADC_HandleTypeDef
    <9e6>   DW_AT_decl_file   : 12
    <9e7>   DW_AT_decl_line   : 219
    <9e8>   DW_AT_decl_column : 2
    <9e9>   DW_AT_type        : <0x973>
 <1><9ed>: Abbrev Number: 12 (DW_TAG_variable)
    <9ee>   DW_AT_name        : (indirect string, offset: 0xceb93): torque_Value
    <9f2>   DW_AT_decl_file   : 1
    <9f2>   DW_AT_decl_line   : 37
    <9f3>   DW_AT_decl_column : 7
    <9f4>   DW_AT_type        : <0x9fe>
    <9f8>   DW_AT_external    : 1
    <9f8>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><9fe>: Abbrev Number: 6 (DW_TAG_base_type)
    <9ff>   DW_AT_byte_size   : 4
    <a00>   DW_AT_encoding    : 4	(float)
    <a01>   DW_AT_name        : (indirect string, offset: 0xe3c33): float
 <1><a05>: Abbrev Number: 12 (DW_TAG_variable)
    <a06>   DW_AT_name        : (indirect string, offset: 0x5973): torqueVoltage
    <a0a>   DW_AT_decl_file   : 1
    <a0a>   DW_AT_decl_line   : 38
    <a0b>   DW_AT_decl_column : 7
    <a0c>   DW_AT_type        : <0x9fe>
    <a10>   DW_AT_external    : 1
    <a10>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><a16>: Abbrev Number: 12 (DW_TAG_variable)
    <a17>   DW_AT_name        : (indirect string, offset: 0x60682): voltage
    <a1b>   DW_AT_decl_file   : 1
    <a1b>   DW_AT_decl_line   : 39
    <a1c>   DW_AT_decl_column : 7
    <a1d>   DW_AT_type        : <0x9fe>
    <a21>   DW_AT_external    : 1
    <a21>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><a27>: Abbrev Number: 12 (DW_TAG_variable)
    <a28>   DW_AT_name        : (indirect string, offset: 0xddda2): filteredTorqueValue
    <a2c>   DW_AT_decl_file   : 1
    <a2c>   DW_AT_decl_line   : 40
    <a2d>   DW_AT_decl_column : 7
    <a2e>   DW_AT_type        : <0x9fe>
    <a32>   DW_AT_external    : 1
    <a32>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><a38>: Abbrev Number: 12 (DW_TAG_variable)
    <a39>   DW_AT_name        : (indirect string, offset: 0x12b35): adcValue
    <a3d>   DW_AT_decl_file   : 1
    <a3d>   DW_AT_decl_line   : 41
    <a3e>   DW_AT_decl_column : 10
    <a3f>   DW_AT_type        : <0x94>
    <a43>   DW_AT_external    : 1
    <a43>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><a49>: Abbrev Number: 12 (DW_TAG_variable)
    <a4a>   DW_AT_name        : (indirect string, offset: 0x6af26): hadc1
    <a4e>   DW_AT_decl_file   : 1
    <a4e>   DW_AT_decl_line   : 55
    <a4f>   DW_AT_decl_column : 19
    <a50>   DW_AT_type        : <0x9e1>
    <a54>   DW_AT_external    : 1
    <a54>   DW_AT_location    : 5 byte block: 3 f0 1 0 20 	(DW_OP_addr: 200001f0)
 <1><a5a>: Abbrev Number: 28 (DW_TAG_subprogram)
    <a5b>   DW_AT_external    : 1
    <a5b>   DW_AT_name        : (indirect string, offset: 0x888f1): HAL_GPIO_Init
    <a5f>   DW_AT_decl_file   : 10
    <a60>   DW_AT_decl_line   : 223
    <a61>   DW_AT_decl_column : 7
    <a62>   DW_AT_prototyped  : 1
    <a62>   DW_AT_declaration : 1
    <a62>   DW_AT_sibling     : <0xa71>
 <2><a66>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <a67>   DW_AT_type        : <0xa71>
 <2><a6b>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <a6c>   DW_AT_type        : <0xa76>
 <2><a70>: Abbrev Number: 0
 <1><a71>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <a72>   DW_AT_byte_size   : 4
    <a72>   DW_AT_type        : <0x2af>
 <1><a76>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <a77>   DW_AT_byte_size   : 4
    <a77>   DW_AT_type        : <0x68f>
 <1><a7b>: Abbrev Number: 11 (DW_TAG_subprogram)
    <a7c>   DW_AT_external    : 1
    <a7c>   DW_AT_name        : (indirect string, offset: 0x5aa9b): HAL_ADC_ConfigChannel
    <a80>   DW_AT_decl_file   : 12
    <a81>   DW_AT_decl_line   : 648
    <a83>   DW_AT_decl_column : 19
    <a83>   DW_AT_prototyped  : 1
    <a83>   DW_AT_type        : <0x4ec>
    <a87>   DW_AT_declaration : 1
    <a87>   DW_AT_sibling     : <0xa96>
 <2><a8b>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <a8c>   DW_AT_type        : <0xa96>
 <2><a90>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <a91>   DW_AT_type        : <0xa9b>
 <2><a95>: Abbrev Number: 0
 <1><a96>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <a97>   DW_AT_byte_size   : 4
    <a97>   DW_AT_type        : <0x9e1>
 <1><a9b>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <a9c>   DW_AT_byte_size   : 4
    <a9c>   DW_AT_type        : <0x967>
 <1><aa0>: Abbrev Number: 11 (DW_TAG_subprogram)
    <aa1>   DW_AT_external    : 1
    <aa1>   DW_AT_name        : (indirect string, offset: 0x1243e): HAL_ADC_Init
    <aa5>   DW_AT_decl_file   : 12
    <aa6>   DW_AT_decl_line   : 602
    <aa8>   DW_AT_decl_column : 19
    <aa8>   DW_AT_prototyped  : 1
    <aa8>   DW_AT_type        : <0x4ec>
    <aac>   DW_AT_declaration : 1
    <aac>   DW_AT_sibling     : <0xab6>
 <2><ab0>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <ab1>   DW_AT_type        : <0xa96>
 <2><ab5>: Abbrev Number: 0
 <1><ab6>: Abbrev Number: 11 (DW_TAG_subprogram)
    <ab7>   DW_AT_external    : 1
    <ab7>   DW_AT_name        : (indirect string, offset: 0xbfd87): HAL_RCC_ClockConfig
    <abb>   DW_AT_decl_file   : 9
    <abc>   DW_AT_decl_line   : 1137
    <abe>   DW_AT_decl_column : 19
    <abe>   DW_AT_prototyped  : 1
    <abe>   DW_AT_type        : <0x4ec>
    <ac2>   DW_AT_declaration : 1
    <ac2>   DW_AT_sibling     : <0xad1>
 <2><ac6>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <ac7>   DW_AT_type        : <0xad1>
 <2><acb>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <acc>   DW_AT_type        : <0x94>
 <2><ad0>: Abbrev Number: 0
 <1><ad1>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <ad2>   DW_AT_byte_size   : 4
    <ad2>   DW_AT_type        : <0x639>
 <1><ad6>: Abbrev Number: 11 (DW_TAG_subprogram)
    <ad7>   DW_AT_external    : 1
    <ad7>   DW_AT_name        : (indirect string, offset: 0x9a548): HAL_RCC_OscConfig
    <adb>   DW_AT_decl_file   : 9
    <adc>   DW_AT_decl_line   : 1136
    <ade>   DW_AT_decl_column : 19
    <ade>   DW_AT_prototyped  : 1
    <ade>   DW_AT_type        : <0x4ec>
    <ae2>   DW_AT_declaration : 1
    <ae2>   DW_AT_sibling     : <0xaec>
 <2><ae6>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <ae7>   DW_AT_type        : <0xaec>
 <2><aeb>: Abbrev Number: 0
 <1><aec>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <aed>   DW_AT_byte_size   : 4
    <aed>   DW_AT_type        : <0x5e3>
 <1><af1>: Abbrev Number: 11 (DW_TAG_subprogram)
    <af2>   DW_AT_external    : 1
    <af2>   DW_AT_name        : (indirect string, offset: 0x6b6ce): HAL_ADC_GetValue
    <af6>   DW_AT_decl_file   : 12
    <af7>   DW_AT_decl_line   : 634
    <af9>   DW_AT_decl_column : 19
    <af9>   DW_AT_prototyped  : 1
    <af9>   DW_AT_type        : <0x94>
    <afd>   DW_AT_declaration : 1
    <afd>   DW_AT_sibling     : <0xb07>
 <2><b01>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <b02>   DW_AT_type        : <0xa96>
 <2><b06>: Abbrev Number: 0
 <1><b07>: Abbrev Number: 11 (DW_TAG_subprogram)
    <b08>   DW_AT_external    : 1
    <b08>   DW_AT_name        : (indirect string, offset: 0x7bd74): HAL_ADC_PollForConversion
    <b0c>   DW_AT_decl_file   : 12
    <b0d>   DW_AT_decl_line   : 622
    <b0f>   DW_AT_decl_column : 19
    <b0f>   DW_AT_prototyped  : 1
    <b0f>   DW_AT_type        : <0x4ec>
    <b13>   DW_AT_declaration : 1
    <b13>   DW_AT_sibling     : <0xb22>
 <2><b17>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <b18>   DW_AT_type        : <0xa96>
 <2><b1c>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <b1d>   DW_AT_type        : <0x94>
 <2><b21>: Abbrev Number: 0
 <1><b22>: Abbrev Number: 11 (DW_TAG_subprogram)
    <b23>   DW_AT_external    : 1
    <b23>   DW_AT_name        : (indirect string, offset: 0x2007): HAL_ADC_Start
    <b27>   DW_AT_decl_file   : 12
    <b28>   DW_AT_decl_line   : 620
    <b2a>   DW_AT_decl_column : 19
    <b2a>   DW_AT_prototyped  : 1
    <b2a>   DW_AT_type        : <0x4ec>
    <b2e>   DW_AT_declaration : 1
    <b2e>   DW_AT_sibling     : <0xb38>
 <2><b32>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <b33>   DW_AT_type        : <0xa96>
 <2><b37>: Abbrev Number: 0
 <1><b38>: Abbrev Number: 29 (DW_TAG_subprogram)
    <b39>   DW_AT_external    : 1
    <b39>   DW_AT_name        : (indirect string, offset: 0xd1920): HAL_Init
    <b3d>   DW_AT_decl_file   : 13
    <b3e>   DW_AT_decl_line   : 185
    <b3f>   DW_AT_decl_column : 19
    <b40>   DW_AT_prototyped  : 1
    <b40>   DW_AT_type        : <0x4ec>
    <b44>   DW_AT_declaration : 1
 <1><b44>: Abbrev Number: 30 (DW_TAG_subprogram)
    <b45>   DW_AT_external    : 1
    <b45>   DW_AT_name        : (indirect string, offset: 0x503bd): Error_Handler
    <b49>   DW_AT_decl_file   : 1
    <b4a>   DW_AT_decl_line   : 322
    <b4c>   DW_AT_decl_column : 6
    <b4d>   DW_AT_prototyped  : 1
    <b4d>   DW_AT_low_pc      : 0x8001238
    <b51>   DW_AT_high_pc     : 0xc
    <b55>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b57>   DW_AT_call_all_calls: 1
    <b57>   DW_AT_sibling     : <0xb6d>
 <2><b5b>: Abbrev Number: 31 (DW_TAG_inlined_subroutine)
    <b5c>   DW_AT_abstract_origin: <0xc8c>
    <b60>   DW_AT_low_pc      : 0x800123c
    <b64>   DW_AT_high_pc     : 0x4
    <b68>   DW_AT_call_file   : 1
    <b69>   DW_AT_call_line   : 326
    <b6b>   DW_AT_call_column : 3
 <2><b6c>: Abbrev Number: 0
 <1><b6d>: Abbrev Number: 32 (DW_TAG_subprogram)
    <b6e>   DW_AT_name        : (indirect string, offset: 0x5b4e9): MX_GPIO_Init
    <b72>   DW_AT_decl_file   : 1
    <b73>   DW_AT_decl_line   : 292
    <b75>   DW_AT_decl_column : 13
    <b76>   DW_AT_prototyped  : 1
    <b76>   DW_AT_low_pc      : 0x80011c8
    <b7a>   DW_AT_high_pc     : 0x70
    <b7e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b80>   DW_AT_call_all_tail_calls: 1
    <b80>   DW_AT_sibling     : <0xbca>
 <2><b84>: Abbrev Number: 18 (DW_TAG_variable)
    <b85>   DW_AT_name        : (indirect string, offset: 0x159cf): GPIO_InitStruct
    <b89>   DW_AT_decl_file   : 1
    <b89>   DW_AT_decl_line   : 294
    <b8b>   DW_AT_decl_column : 20
    <b8c>   DW_AT_type        : <0x68f>
    <b90>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><b93>: Abbrev Number: 22 (DW_TAG_lexical_block)
    <b94>   DW_AT_low_pc      : 0x80011de
    <b98>   DW_AT_high_pc     : 0x18
    <b9c>   DW_AT_sibling     : <0xbb0>
 <3><ba0>: Abbrev Number: 18 (DW_TAG_variable)
    <ba1>   DW_AT_name        : (indirect string, offset: 0x1985): tmpreg
    <ba5>   DW_AT_decl_file   : 1
    <ba5>   DW_AT_decl_line   : 299
    <ba7>   DW_AT_decl_column : 3
    <ba8>   DW_AT_type        : <0xa0>
    <bac>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><baf>: Abbrev Number: 0
 <2><bb0>: Abbrev Number: 19 (DW_TAG_lexical_block)
    <bb1>   DW_AT_low_pc      : 0x80011f6
    <bb5>   DW_AT_high_pc     : 0x18
 <3><bb9>: Abbrev Number: 18 (DW_TAG_variable)
    <bba>   DW_AT_name        : (indirect string, offset: 0x1985): tmpreg
    <bbe>   DW_AT_decl_file   : 1
    <bbe>   DW_AT_decl_line   : 300
    <bc0>   DW_AT_decl_column : 3
    <bc1>   DW_AT_type        : <0xa0>
    <bc5>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <3><bc8>: Abbrev Number: 0
 <2><bc9>: Abbrev Number: 0
 <1><bca>: Abbrev Number: 33 (DW_TAG_subprogram)
    <bcb>   DW_AT_name        : (indirect string, offset: 0x3fc8c): MX_ADC1_Init
    <bcf>   DW_AT_decl_file   : 1
    <bd0>   DW_AT_decl_line   : 240
    <bd1>   DW_AT_decl_column : 13
    <bd2>   DW_AT_prototyped  : 1
    <bd2>   DW_AT_low_pc      : 0x8001124
    <bd6>   DW_AT_high_pc     : 0xa4
    <bda>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <bdc>   DW_AT_call_all_tail_calls: 1
    <bdc>   DW_AT_sibling     : <0xbef>
 <2><be0>: Abbrev Number: 13 (DW_TAG_variable)
    <be1>   DW_AT_name        : (indirect string, offset: 0xd53e0): sConfig
    <be5>   DW_AT_decl_file   : 1
    <be5>   DW_AT_decl_line   : 247
    <be6>   DW_AT_decl_column : 26
    <be7>   DW_AT_type        : <0x967>
    <beb>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><bee>: Abbrev Number: 0
 <1><bef>: Abbrev Number: 34 (DW_TAG_subprogram)
    <bf0>   DW_AT_external    : 1
    <bf0>   DW_AT_name        : (indirect string, offset: 0x9ac0d): SystemClock_Config
    <bf4>   DW_AT_decl_file   : 1
    <bf5>   DW_AT_decl_line   : 197
    <bf6>   DW_AT_decl_column : 6
    <bf7>   DW_AT_prototyped  : 1
    <bf7>   DW_AT_low_pc      : 0x800106c
    <bfb>   DW_AT_high_pc     : 0xb8
    <bff>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c01>   DW_AT_call_all_tail_calls: 1
    <c01>   DW_AT_sibling     : <0xc59>
 <2><c05>: Abbrev Number: 13 (DW_TAG_variable)
    <c06>   DW_AT_name        : (indirect string, offset: 0x30d6d): RCC_OscInitStruct
    <c0a>   DW_AT_decl_file   : 1
    <c0a>   DW_AT_decl_line   : 199
    <c0b>   DW_AT_decl_column : 22
    <c0c>   DW_AT_type        : <0x5e3>
    <c10>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><c13>: Abbrev Number: 13 (DW_TAG_variable)
    <c14>   DW_AT_name        : (indirect string, offset: 0x548b6): RCC_ClkInitStruct
    <c18>   DW_AT_decl_file   : 1
    <c18>   DW_AT_decl_line   : 200
    <c19>   DW_AT_decl_column : 22
    <c1a>   DW_AT_type        : <0x639>
    <c1e>   DW_AT_location    : 3 byte block: 91 b4 7f 	(DW_OP_fbreg: -76)
 <2><c22>: Abbrev Number: 22 (DW_TAG_lexical_block)
    <c23>   DW_AT_low_pc      : 0x8001090
    <c27>   DW_AT_high_pc     : 0x18
    <c2b>   DW_AT_sibling     : <0xc3f>
 <3><c2f>: Abbrev Number: 13 (DW_TAG_variable)
    <c30>   DW_AT_name        : (indirect string, offset: 0x1985): tmpreg
    <c34>   DW_AT_decl_file   : 1
    <c34>   DW_AT_decl_line   : 204
    <c35>   DW_AT_decl_column : 3
    <c36>   DW_AT_type        : <0xa0>
    <c3a>   DW_AT_location    : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <3><c3e>: Abbrev Number: 0
 <2><c3f>: Abbrev Number: 19 (DW_TAG_lexical_block)
    <c40>   DW_AT_low_pc      : 0x80010a8
    <c44>   DW_AT_high_pc     : 0x1c
 <3><c48>: Abbrev Number: 13 (DW_TAG_variable)
    <c49>   DW_AT_name        : (indirect string, offset: 0x1985): tmpreg
    <c4d>   DW_AT_decl_file   : 1
    <c4d>   DW_AT_decl_line   : 205
    <c4e>   DW_AT_decl_column : 3
    <c4f>   DW_AT_type        : <0xa0>
    <c53>   DW_AT_location    : 3 byte block: 91 ac 7f 	(DW_OP_fbreg: -84)
 <3><c57>: Abbrev Number: 0
 <2><c58>: Abbrev Number: 0
 <1><c59>: Abbrev Number: 35 (DW_TAG_subprogram)
    <c5a>   DW_AT_external    : 1
    <c5a>   DW_AT_name        : (indirect string, offset: 0x166ad): main
    <c5e>   DW_AT_decl_file   : 1
    <c5f>   DW_AT_decl_line   : 90
    <c60>   DW_AT_decl_column : 5
    <c61>   DW_AT_prototyped  : 1
    <c61>   DW_AT_type        : <0x7a>
    <c65>   DW_AT_low_pc      : 0x8001024
    <c69>   DW_AT_high_pc     : 0x48
    <c6d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c6f>   DW_AT_call_all_tail_calls: 1
    <c6f>   DW_AT_sibling     : <0xc8c>
 <2><c73>: Abbrev Number: 19 (DW_TAG_lexical_block)
    <c74>   DW_AT_low_pc      : 0x800103a
    <c78>   DW_AT_high_pc     : 0x2c
 <3><c7c>: Abbrev Number: 13 (DW_TAG_variable)
    <c7d>   DW_AT_name        : (indirect string, offset: 0x12b35): adcValue
    <c81>   DW_AT_decl_file   : 1
    <c81>   DW_AT_decl_line   : 141
    <c82>   DW_AT_decl_column : 14
    <c83>   DW_AT_type        : <0x94>
    <c87>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><c8a>: Abbrev Number: 0
 <2><c8b>: Abbrev Number: 0
 <1><c8c>: Abbrev Number: 36 (DW_TAG_subprogram)
    <c8d>   DW_AT_name        : (indirect string, offset: 0x7ae0a): __disable_irq
    <c91>   DW_AT_decl_file   : 2
    <c92>   DW_AT_decl_line   : 140
    <c93>   DW_AT_decl_column : 27
    <c94>   DW_AT_prototyped  : 1
    <c94>   DW_AT_inline      : 3	(declared as inline and inlined)
 <1><c95>: Abbrev Number: 0
  Compilation Unit @ offset 0xc96:
   Length:        0x90c (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x255
   Pointer Size:  4
 <0><ca2>: Abbrev Number: 23 (DW_TAG_compile_unit)
    <ca3>   DW_AT_producer    : (indirect string, offset: 0x73538): GNU C11 12.3.1 20230626 -mcpu=cortex-m7 -mfpu=fpv5-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fpv5 -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <ca7>   DW_AT_language    : 29	(C11)
    <ca8>   DW_AT_name        : (indirect string, offset: 0xe07d6): ../Core/Src/stm32f7xx_hal_msp.c
    <cac>   DW_AT_comp_dir    : (indirect string, offset: 0x98ce9): C:/Users/asus/STM32CubeIDE/workspace_1.14.1/TorqueSensor/Debug
    <cb0>   DW_AT_ranges      : 0x39
    <cb4>   DW_AT_low_pc      : 0
    <cb8>   DW_AT_stmt_list   : 0x843
    <cbc>   DW_AT_macros      : 0x22fa2
 <1><cc0>: Abbrev Number: 4 (DW_TAG_base_type)
    <cc1>   DW_AT_byte_size   : 1
    <cc2>   DW_AT_encoding    : 6	(signed char)
    <cc3>   DW_AT_name        : (indirect string, offset: 0x6ff02): signed char
 <1><cc7>: Abbrev Number: 4 (DW_TAG_base_type)
    <cc8>   DW_AT_byte_size   : 1
    <cc9>   DW_AT_encoding    : 8	(unsigned char)
    <cca>   DW_AT_name        : (indirect string, offset: 0xd7c31): unsigned char
 <1><cce>: Abbrev Number: 4 (DW_TAG_base_type)
    <ccf>   DW_AT_byte_size   : 2
    <cd0>   DW_AT_encoding    : 5	(signed)
    <cd1>   DW_AT_name        : (indirect string, offset: 0xa67e2): short int
 <1><cd5>: Abbrev Number: 3 (DW_TAG_typedef)
    <cd6>   DW_AT_name        : (indirect string, offset: 0xb672f): __uint16_t
    <cda>   DW_AT_decl_file   : 2
    <cdb>   DW_AT_decl_line   : 57
    <cdc>   DW_AT_decl_column : 25
    <cdd>   DW_AT_type        : <0xce1>
 <1><ce1>: Abbrev Number: 4 (DW_TAG_base_type)
    <ce2>   DW_AT_byte_size   : 2
    <ce3>   DW_AT_encoding    : 7	(unsigned)
    <ce4>   DW_AT_name        : (indirect string, offset: 0xd63c2): short unsigned int
 <1><ce8>: Abbrev Number: 4 (DW_TAG_base_type)
    <ce9>   DW_AT_byte_size   : 4
    <cea>   DW_AT_encoding    : 5	(signed)
    <ceb>   DW_AT_name        : (indirect string, offset: 0x1308b): long int
 <1><cef>: Abbrev Number: 3 (DW_TAG_typedef)
    <cf0>   DW_AT_name        : (indirect string, offset: 0x8d8f5): __uint32_t
    <cf4>   DW_AT_decl_file   : 2
    <cf5>   DW_AT_decl_line   : 79
    <cf6>   DW_AT_decl_column : 25
    <cf7>   DW_AT_type        : <0xcfb>
 <1><cfb>: Abbrev Number: 4 (DW_TAG_base_type)
    <cfc>   DW_AT_byte_size   : 4
    <cfd>   DW_AT_encoding    : 7	(unsigned)
    <cfe>   DW_AT_name        : (indirect string, offset: 0x559ba): long unsigned int
 <1><d02>: Abbrev Number: 4 (DW_TAG_base_type)
    <d03>   DW_AT_byte_size   : 8
    <d04>   DW_AT_encoding    : 5	(signed)
    <d05>   DW_AT_name        : (indirect string, offset: 0x660a1): long long int
 <1><d09>: Abbrev Number: 4 (DW_TAG_base_type)
    <d0a>   DW_AT_byte_size   : 8
    <d0b>   DW_AT_encoding    : 7	(unsigned)
    <d0c>   DW_AT_name        : (indirect string, offset: 0x2ee33): long long unsigned int
 <1><d10>: Abbrev Number: 24 (DW_TAG_base_type)
    <d11>   DW_AT_byte_size   : 4
    <d12>   DW_AT_encoding    : 5	(signed)
    <d13>   DW_AT_name        : int
 <1><d17>: Abbrev Number: 4 (DW_TAG_base_type)
    <d18>   DW_AT_byte_size   : 4
    <d19>   DW_AT_encoding    : 7	(unsigned)
    <d1a>   DW_AT_name        : (indirect string, offset: 0x12332): unsigned int
 <1><d1e>: Abbrev Number: 3 (DW_TAG_typedef)
    <d1f>   DW_AT_name        : (indirect string, offset: 0xb6731): uint16_t
    <d23>   DW_AT_decl_file   : 3
    <d24>   DW_AT_decl_line   : 36
    <d25>   DW_AT_decl_column : 20
    <d26>   DW_AT_type        : <0xcd5>
 <1><d2a>: Abbrev Number: 3 (DW_TAG_typedef)
    <d2b>   DW_AT_name        : (indirect string, offset: 0x8d8f7): uint32_t
    <d2f>   DW_AT_decl_file   : 3
    <d30>   DW_AT_decl_line   : 48
    <d31>   DW_AT_decl_column : 20
    <d32>   DW_AT_type        : <0xcef>
 <1><d36>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <d37>   DW_AT_type        : <0xd2a>
 <1><d3b>: Abbrev Number: 16 (DW_TAG_array_type)
    <d3c>   DW_AT_type        : <0xd2a>
    <d40>   DW_AT_sibling     : <0xd4a>
 <2><d44>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <d45>   DW_AT_type        : <0xd17>
    <d49>   DW_AT_upper_bound : 1
 <2><d49>: Abbrev Number: 0
 <1><d4a>: Abbrev Number: 9 (DW_TAG_structure_type)
    <d4b>   DW_AT_byte_size   : 80
    <d4c>   DW_AT_decl_file   : 4
    <d4d>   DW_AT_decl_line   : 187
    <d4e>   DW_AT_decl_column : 9
    <d4e>   DW_AT_sibling     : <0xe55>
 <2><d52>: Abbrev Number: 8 (DW_TAG_member)
    <d53>   DW_AT_name        : SR
    <d56>   DW_AT_decl_file   : 4
    <d57>   DW_AT_decl_line   : 189
    <d58>   DW_AT_decl_column : 17
    <d59>   DW_AT_type        : <0xd36>
    <d5d>   DW_AT_data_member_location: 0
 <2><d5e>: Abbrev Number: 8 (DW_TAG_member)
    <d5f>   DW_AT_name        : CR1
    <d63>   DW_AT_decl_file   : 4
    <d64>   DW_AT_decl_line   : 190
    <d65>   DW_AT_decl_column : 17
    <d66>   DW_AT_type        : <0xd36>
    <d6a>   DW_AT_data_member_location: 4
 <2><d6b>: Abbrev Number: 8 (DW_TAG_member)
    <d6c>   DW_AT_name        : CR2
    <d70>   DW_AT_decl_file   : 4
    <d71>   DW_AT_decl_line   : 191
    <d72>   DW_AT_decl_column : 17
    <d73>   DW_AT_type        : <0xd36>
    <d77>   DW_AT_data_member_location: 8
 <2><d78>: Abbrev Number: 1 (DW_TAG_member)
    <d79>   DW_AT_name        : (indirect string, offset: 0xbe54b): SMPR1
    <d7d>   DW_AT_decl_file   : 4
    <d7e>   DW_AT_decl_line   : 192
    <d7f>   DW_AT_decl_column : 17
    <d80>   DW_AT_type        : <0xd36>
    <d84>   DW_AT_data_member_location: 12
 <2><d85>: Abbrev Number: 1 (DW_TAG_member)
    <d86>   DW_AT_name        : (indirect string, offset: 0x5040e): SMPR2
    <d8a>   DW_AT_decl_file   : 4
    <d8b>   DW_AT_decl_line   : 193
    <d8c>   DW_AT_decl_column : 17
    <d8d>   DW_AT_type        : <0xd36>
    <d91>   DW_AT_data_member_location: 16
 <2><d92>: Abbrev Number: 1 (DW_TAG_member)
    <d93>   DW_AT_name        : (indirect string, offset: 0x4d118): JOFR1
    <d97>   DW_AT_decl_file   : 4
    <d98>   DW_AT_decl_line   : 194
    <d99>   DW_AT_decl_column : 17
    <d9a>   DW_AT_type        : <0xd36>
    <d9e>   DW_AT_data_member_location: 20
 <2><d9f>: Abbrev Number: 1 (DW_TAG_member)
    <da0>   DW_AT_name        : (indirect string, offset: 0x4d11e): JOFR2
    <da4>   DW_AT_decl_file   : 4
    <da5>   DW_AT_decl_line   : 195
    <da6>   DW_AT_decl_column : 17
    <da7>   DW_AT_type        : <0xd36>
    <dab>   DW_AT_data_member_location: 24
 <2><dac>: Abbrev Number: 1 (DW_TAG_member)
    <dad>   DW_AT_name        : (indirect string, offset: 0x4d124): JOFR3
    <db1>   DW_AT_decl_file   : 4
    <db2>   DW_AT_decl_line   : 196
    <db3>   DW_AT_decl_column : 17
    <db4>   DW_AT_type        : <0xd36>
    <db8>   DW_AT_data_member_location: 28
 <2><db9>: Abbrev Number: 1 (DW_TAG_member)
    <dba>   DW_AT_name        : (indirect string, offset: 0x30517): JOFR4
    <dbe>   DW_AT_decl_file   : 4
    <dbf>   DW_AT_decl_line   : 197
    <dc0>   DW_AT_decl_column : 17
    <dc1>   DW_AT_type        : <0xd36>
    <dc5>   DW_AT_data_member_location: 32
 <2><dc6>: Abbrev Number: 8 (DW_TAG_member)
    <dc7>   DW_AT_name        : HTR
    <dcb>   DW_AT_decl_file   : 4
    <dcc>   DW_AT_decl_line   : 198
    <dcd>   DW_AT_decl_column : 17
    <dce>   DW_AT_type        : <0xd36>
    <dd2>   DW_AT_data_member_location: 36
 <2><dd3>: Abbrev Number: 8 (DW_TAG_member)
    <dd4>   DW_AT_name        : LTR
    <dd8>   DW_AT_decl_file   : 4
    <dd9>   DW_AT_decl_line   : 199
    <dda>   DW_AT_decl_column : 17
    <ddb>   DW_AT_type        : <0xd36>
    <ddf>   DW_AT_data_member_location: 40
 <2><de0>: Abbrev Number: 1 (DW_TAG_member)
    <de1>   DW_AT_name        : (indirect string, offset: 0x9b80f): SQR1
    <de5>   DW_AT_decl_file   : 4
    <de6>   DW_AT_decl_line   : 200
    <de7>   DW_AT_decl_column : 17
    <de8>   DW_AT_type        : <0xd36>
    <dec>   DW_AT_data_member_location: 44
 <2><ded>: Abbrev Number: 1 (DW_TAG_member)
    <dee>   DW_AT_name        : (indirect string, offset: 0x10fd6): SQR2
    <df2>   DW_AT_decl_file   : 4
    <df3>   DW_AT_decl_line   : 201
    <df4>   DW_AT_decl_column : 17
    <df5>   DW_AT_type        : <0xd36>
    <df9>   DW_AT_data_member_location: 48
 <2><dfa>: Abbrev Number: 1 (DW_TAG_member)
    <dfb>   DW_AT_name        : (indirect string, offset: 0x10fdb): SQR3
    <dff>   DW_AT_decl_file   : 4
    <e00>   DW_AT_decl_line   : 202
    <e01>   DW_AT_decl_column : 17
    <e02>   DW_AT_type        : <0xd36>
    <e06>   DW_AT_data_member_location: 52
 <2><e07>: Abbrev Number: 1 (DW_TAG_member)
    <e08>   DW_AT_name        : (indirect string, offset: 0x48749): JSQR
    <e0c>   DW_AT_decl_file   : 4
    <e0d>   DW_AT_decl_line   : 203
    <e0e>   DW_AT_decl_column : 17
    <e0f>   DW_AT_type        : <0xd36>
    <e13>   DW_AT_data_member_location: 56
 <2><e14>: Abbrev Number: 1 (DW_TAG_member)
    <e15>   DW_AT_name        : (indirect string, offset: 0x8e933): JDR1
    <e19>   DW_AT_decl_file   : 4
    <e1a>   DW_AT_decl_line   : 204
    <e1b>   DW_AT_decl_column : 17
    <e1c>   DW_AT_type        : <0xd36>
    <e20>   DW_AT_data_member_location: 60
 <2><e21>: Abbrev Number: 1 (DW_TAG_member)
    <e22>   DW_AT_name        : (indirect string, offset: 0x8e938): JDR2
    <e26>   DW_AT_decl_file   : 4
    <e27>   DW_AT_decl_line   : 205
    <e28>   DW_AT_decl_column : 17
    <e29>   DW_AT_type        : <0xd36>
    <e2d>   DW_AT_data_member_location: 64
 <2><e2e>: Abbrev Number: 1 (DW_TAG_member)
    <e2f>   DW_AT_name        : (indirect string, offset: 0x8e93d): JDR3
    <e33>   DW_AT_decl_file   : 4
    <e34>   DW_AT_decl_line   : 206
    <e35>   DW_AT_decl_column : 17
    <e36>   DW_AT_type        : <0xd36>
    <e3a>   DW_AT_data_member_location: 68
 <2><e3b>: Abbrev Number: 1 (DW_TAG_member)
    <e3c>   DW_AT_name        : (indirect string, offset: 0x3b90b): JDR4
    <e40>   DW_AT_decl_file   : 4
    <e41>   DW_AT_decl_line   : 207
    <e42>   DW_AT_decl_column : 17
    <e43>   DW_AT_type        : <0xd36>
    <e47>   DW_AT_data_member_location: 72
 <2><e48>: Abbrev Number: 8 (DW_TAG_member)
    <e49>   DW_AT_name        : DR
    <e4c>   DW_AT_decl_file   : 4
    <e4d>   DW_AT_decl_line   : 208
    <e4e>   DW_AT_decl_column : 17
    <e4f>   DW_AT_type        : <0xd36>
    <e53>   DW_AT_data_member_location: 76
 <2><e54>: Abbrev Number: 0
 <1><e55>: Abbrev Number: 3 (DW_TAG_typedef)
    <e56>   DW_AT_name        : (indirect string, offset: 0xab867): ADC_TypeDef
    <e5a>   DW_AT_decl_file   : 4
    <e5b>   DW_AT_decl_line   : 209
    <e5c>   DW_AT_decl_column : 3
    <e5d>   DW_AT_type        : <0xd4a>
 <1><e61>: Abbrev Number: 13 (DW_TAG_structure_type)
    <e62>   DW_AT_byte_size   : 24
    <e63>   DW_AT_decl_file   : 4
    <e63>   DW_AT_decl_line   : 372
    <e65>   DW_AT_decl_column : 9
    <e65>   DW_AT_sibling     : <0xeb1>
 <2><e69>: Abbrev Number: 6 (DW_TAG_member)
    <e6a>   DW_AT_name        : CR
    <e6d>   DW_AT_decl_file   : 4
    <e6d>   DW_AT_decl_line   : 374
    <e6f>   DW_AT_decl_column : 17
    <e6f>   DW_AT_type        : <0xd36>
    <e73>   DW_AT_data_member_location: 0
 <2><e74>: Abbrev Number: 2 (DW_TAG_member)
    <e75>   DW_AT_name        : (indirect string, offset: 0x1ac14): NDTR
    <e79>   DW_AT_decl_file   : 4
    <e79>   DW_AT_decl_line   : 375
    <e7b>   DW_AT_decl_column : 17
    <e7b>   DW_AT_type        : <0xd36>
    <e7f>   DW_AT_data_member_location: 4
 <2><e80>: Abbrev Number: 6 (DW_TAG_member)
    <e81>   DW_AT_name        : PAR
    <e85>   DW_AT_decl_file   : 4
    <e85>   DW_AT_decl_line   : 376
    <e87>   DW_AT_decl_column : 17
    <e87>   DW_AT_type        : <0xd36>
    <e8b>   DW_AT_data_member_location: 8
 <2><e8c>: Abbrev Number: 2 (DW_TAG_member)
    <e8d>   DW_AT_name        : (indirect string, offset: 0x5d1e8): M0AR
    <e91>   DW_AT_decl_file   : 4
    <e91>   DW_AT_decl_line   : 377
    <e93>   DW_AT_decl_column : 17
    <e93>   DW_AT_type        : <0xd36>
    <e97>   DW_AT_data_member_location: 12
 <2><e98>: Abbrev Number: 2 (DW_TAG_member)
    <e99>   DW_AT_name        : (indirect string, offset: 0x7b231): M1AR
    <e9d>   DW_AT_decl_file   : 4
    <e9d>   DW_AT_decl_line   : 378
    <e9f>   DW_AT_decl_column : 17
    <e9f>   DW_AT_type        : <0xd36>
    <ea3>   DW_AT_data_member_location: 16
 <2><ea4>: Abbrev Number: 6 (DW_TAG_member)
    <ea5>   DW_AT_name        : FCR
    <ea9>   DW_AT_decl_file   : 4
    <ea9>   DW_AT_decl_line   : 379
    <eab>   DW_AT_decl_column : 17
    <eab>   DW_AT_type        : <0xd36>
    <eaf>   DW_AT_data_member_location: 20
 <2><eb0>: Abbrev Number: 0
 <1><eb1>: Abbrev Number: 14 (DW_TAG_typedef)
    <eb2>   DW_AT_name        : (indirect string, offset: 0x1bc1f): DMA_Stream_TypeDef
    <eb6>   DW_AT_decl_file   : 4
    <eb6>   DW_AT_decl_line   : 380
    <eb8>   DW_AT_decl_column : 3
    <eb8>   DW_AT_type        : <0xe61>
 <1><ebc>: Abbrev Number: 16 (DW_TAG_array_type)
    <ebd>   DW_AT_type        : <0xd36>
    <ec1>   DW_AT_sibling     : <0xecb>
 <2><ec5>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <ec6>   DW_AT_type        : <0xd17>
    <eca>   DW_AT_upper_bound : 1
 <2><eca>: Abbrev Number: 0
 <1><ecb>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <ecc>   DW_AT_type        : <0xebc>
 <1><ed0>: Abbrev Number: 13 (DW_TAG_structure_type)
    <ed1>   DW_AT_byte_size   : 40
    <ed2>   DW_AT_decl_file   : 4
    <ed2>   DW_AT_decl_line   : 579
    <ed4>   DW_AT_decl_column : 9
    <ed4>   DW_AT_sibling     : <0xf45>
 <2><ed8>: Abbrev Number: 2 (DW_TAG_member)
    <ed9>   DW_AT_name        : (indirect string, offset: 0x1883): MODER
    <edd>   DW_AT_decl_file   : 4
    <edd>   DW_AT_decl_line   : 581
    <edf>   DW_AT_decl_column : 17
    <edf>   DW_AT_type        : <0xd36>
    <ee3>   DW_AT_data_member_location: 0
 <2><ee4>: Abbrev Number: 2 (DW_TAG_member)
    <ee5>   DW_AT_name        : (indirect string, offset: 0xad1ae): OTYPER
    <ee9>   DW_AT_decl_file   : 4
    <ee9>   DW_AT_decl_line   : 582
    <eeb>   DW_AT_decl_column : 17
    <eeb>   DW_AT_type        : <0xd36>
    <eef>   DW_AT_data_member_location: 4
 <2><ef0>: Abbrev Number: 2 (DW_TAG_member)
    <ef1>   DW_AT_name        : (indirect string, offset: 0xc278b): OSPEEDR
    <ef5>   DW_AT_decl_file   : 4
    <ef5>   DW_AT_decl_line   : 583
    <ef7>   DW_AT_decl_column : 17
    <ef7>   DW_AT_type        : <0xd36>
    <efb>   DW_AT_data_member_location: 8
 <2><efc>: Abbrev Number: 2 (DW_TAG_member)
    <efd>   DW_AT_name        : (indirect string, offset: 0x9043e): PUPDR
    <f01>   DW_AT_decl_file   : 4
    <f01>   DW_AT_decl_line   : 584
    <f03>   DW_AT_decl_column : 17
    <f03>   DW_AT_type        : <0xd36>
    <f07>   DW_AT_data_member_location: 12
 <2><f08>: Abbrev Number: 6 (DW_TAG_member)
    <f09>   DW_AT_name        : IDR
    <f0d>   DW_AT_decl_file   : 4
    <f0d>   DW_AT_decl_line   : 585
    <f0f>   DW_AT_decl_column : 17
    <f0f>   DW_AT_type        : <0xd36>
    <f13>   DW_AT_data_member_location: 16
 <2><f14>: Abbrev Number: 6 (DW_TAG_member)
    <f15>   DW_AT_name        : ODR
    <f19>   DW_AT_decl_file   : 4
    <f19>   DW_AT_decl_line   : 586
    <f1b>   DW_AT_decl_column : 17
    <f1b>   DW_AT_type        : <0xd36>
    <f1f>   DW_AT_data_member_location: 20
 <2><f20>: Abbrev Number: 2 (DW_TAG_member)
    <f21>   DW_AT_name        : (indirect string, offset: 0x32576): BSRR
    <f25>   DW_AT_decl_file   : 4
    <f25>   DW_AT_decl_line   : 587
    <f27>   DW_AT_decl_column : 17
    <f27>   DW_AT_type        : <0xd36>
    <f2b>   DW_AT_data_member_location: 24
 <2><f2c>: Abbrev Number: 2 (DW_TAG_member)
    <f2d>   DW_AT_name        : (indirect string, offset: 0xbfed1): LCKR
    <f31>   DW_AT_decl_file   : 4
    <f31>   DW_AT_decl_line   : 588
    <f33>   DW_AT_decl_column : 17
    <f33>   DW_AT_type        : <0xd36>
    <f37>   DW_AT_data_member_location: 28
 <2><f38>: Abbrev Number: 6 (DW_TAG_member)
    <f39>   DW_AT_name        : AFR
    <f3d>   DW_AT_decl_file   : 4
    <f3d>   DW_AT_decl_line   : 589
    <f3f>   DW_AT_decl_column : 17
    <f3f>   DW_AT_type        : <0xecb>
    <f43>   DW_AT_data_member_location: 32
 <2><f44>: Abbrev Number: 0
 <1><f45>: Abbrev Number: 14 (DW_TAG_typedef)
    <f46>   DW_AT_name        : (indirect string, offset: 0xd908d): GPIO_TypeDef
    <f4a>   DW_AT_decl_file   : 4
    <f4a>   DW_AT_decl_line   : 590
    <f4c>   DW_AT_decl_column : 3
    <f4c>   DW_AT_type        : <0xed0>
 <1><f50>: Abbrev Number: 13 (DW_TAG_structure_type)
    <f51>   DW_AT_byte_size   : 148
    <f52>   DW_AT_decl_file   : 4
    <f52>   DW_AT_decl_line   : 703
    <f54>   DW_AT_decl_column : 9
    <f54>   DW_AT_sibling     : <0x10e4>
 <2><f58>: Abbrev Number: 6 (DW_TAG_member)
    <f59>   DW_AT_name        : CR
    <f5c>   DW_AT_decl_file   : 4
    <f5c>   DW_AT_decl_line   : 705
    <f5e>   DW_AT_decl_column : 17
    <f5e>   DW_AT_type        : <0xd36>
    <f62>   DW_AT_data_member_location: 0
 <2><f63>: Abbrev Number: 2 (DW_TAG_member)
    <f64>   DW_AT_name        : (indirect string, offset: 0x9c7d5): PLLCFGR
    <f68>   DW_AT_decl_file   : 4
    <f68>   DW_AT_decl_line   : 706
    <f6a>   DW_AT_decl_column : 17
    <f6a>   DW_AT_type        : <0xd36>
    <f6e>   DW_AT_data_member_location: 4
 <2><f6f>: Abbrev Number: 2 (DW_TAG_member)
    <f70>   DW_AT_name        : (indirect string, offset: 0x3df36): CFGR
    <f74>   DW_AT_decl_file   : 4
    <f74>   DW_AT_decl_line   : 707
    <f76>   DW_AT_decl_column : 17
    <f76>   DW_AT_type        : <0xd36>
    <f7a>   DW_AT_data_member_location: 8
 <2><f7b>: Abbrev Number: 6 (DW_TAG_member)
    <f7c>   DW_AT_name        : CIR
    <f80>   DW_AT_decl_file   : 4
    <f80>   DW_AT_decl_line   : 708
    <f82>   DW_AT_decl_column : 17
    <f82>   DW_AT_type        : <0xd36>
    <f86>   DW_AT_data_member_location: 12
 <2><f87>: Abbrev Number: 2 (DW_TAG_member)
    <f88>   DW_AT_name        : (indirect string, offset: 0xb1fec): AHB1RSTR
    <f8c>   DW_AT_decl_file   : 4
    <f8c>   DW_AT_decl_line   : 709
    <f8e>   DW_AT_decl_column : 17
    <f8e>   DW_AT_type        : <0xd36>
    <f92>   DW_AT_data_member_location: 16
 <2><f93>: Abbrev Number: 2 (DW_TAG_member)
    <f94>   DW_AT_name        : (indirect string, offset: 0x19f4c): AHB2RSTR
    <f98>   DW_AT_decl_file   : 4
    <f98>   DW_AT_decl_line   : 710
    <f9a>   DW_AT_decl_column : 17
    <f9a>   DW_AT_type        : <0xd36>
    <f9e>   DW_AT_data_member_location: 20
 <2><f9f>: Abbrev Number: 2 (DW_TAG_member)
    <fa0>   DW_AT_name        : (indirect string, offset: 0x6197e): AHB3RSTR
    <fa4>   DW_AT_decl_file   : 4
    <fa4>   DW_AT_decl_line   : 711
    <fa6>   DW_AT_decl_column : 17
    <fa6>   DW_AT_type        : <0xd36>
    <faa>   DW_AT_data_member_location: 24
 <2><fab>: Abbrev Number: 2 (DW_TAG_member)
    <fac>   DW_AT_name        : (indirect string, offset: 0xd2eab): RESERVED0
    <fb0>   DW_AT_decl_file   : 4
    <fb0>   DW_AT_decl_line   : 712
    <fb2>   DW_AT_decl_column : 17
    <fb2>   DW_AT_type        : <0xd2a>
    <fb6>   DW_AT_data_member_location: 28
 <2><fb7>: Abbrev Number: 2 (DW_TAG_member)
    <fb8>   DW_AT_name        : (indirect string, offset: 0x19973): APB1RSTR
    <fbc>   DW_AT_decl_file   : 4
    <fbc>   DW_AT_decl_line   : 713
    <fbe>   DW_AT_decl_column : 17
    <fbe>   DW_AT_type        : <0xd36>
    <fc2>   DW_AT_data_member_location: 32
 <2><fc3>: Abbrev Number: 2 (DW_TAG_member)
    <fc4>   DW_AT_name        : (indirect string, offset: 0x61344): APB2RSTR
    <fc8>   DW_AT_decl_file   : 4
    <fc8>   DW_AT_decl_line   : 714
    <fca>   DW_AT_decl_column : 17
    <fca>   DW_AT_type        : <0xd36>
    <fce>   DW_AT_data_member_location: 36
 <2><fcf>: Abbrev Number: 2 (DW_TAG_member)
    <fd0>   DW_AT_name        : (indirect string, offset: 0xd2eb5): RESERVED1
    <fd4>   DW_AT_decl_file   : 4
    <fd4>   DW_AT_decl_line   : 715
    <fd6>   DW_AT_decl_column : 17
    <fd6>   DW_AT_type        : <0xd3b>
    <fda>   DW_AT_data_member_location: 40
 <2><fdb>: Abbrev Number: 2 (DW_TAG_member)
    <fdc>   DW_AT_name        : (indirect string, offset: 0x122c7): AHB1ENR
    <fe0>   DW_AT_decl_file   : 4
    <fe0>   DW_AT_decl_line   : 716
    <fe2>   DW_AT_decl_column : 17
    <fe2>   DW_AT_type        : <0xd36>
    <fe6>   DW_AT_data_member_location: 48
 <2><fe7>: Abbrev Number: 2 (DW_TAG_member)
    <fe8>   DW_AT_name        : (indirect string, offset: 0x3b6fa): AHB2ENR
    <fec>   DW_AT_decl_file   : 4
    <fec>   DW_AT_decl_line   : 717
    <fee>   DW_AT_decl_column : 17
    <fee>   DW_AT_type        : <0xd36>
    <ff2>   DW_AT_data_member_location: 52
 <2><ff3>: Abbrev Number: 2 (DW_TAG_member)
    <ff4>   DW_AT_name        : (indirect string, offset: 0x645e9): AHB3ENR
    <ff8>   DW_AT_decl_file   : 4
    <ff8>   DW_AT_decl_line   : 718
    <ffa>   DW_AT_decl_column : 17
    <ffa>   DW_AT_type        : <0xd36>
    <ffe>   DW_AT_data_member_location: 56
 <2><fff>: Abbrev Number: 2 (DW_TAG_member)
    <1000>   DW_AT_name        : (indirect string, offset: 0xd2ebf): RESERVED2
    <1004>   DW_AT_decl_file   : 4
    <1004>   DW_AT_decl_line   : 719
    <1006>   DW_AT_decl_column : 17
    <1006>   DW_AT_type        : <0xd2a>
    <100a>   DW_AT_data_member_location: 60
 <2><100b>: Abbrev Number: 2 (DW_TAG_member)
    <100c>   DW_AT_name        : (indirect string, offset: 0x801bc): APB1ENR
    <1010>   DW_AT_decl_file   : 4
    <1010>   DW_AT_decl_line   : 720
    <1012>   DW_AT_decl_column : 17
    <1012>   DW_AT_type        : <0xd36>
    <1016>   DW_AT_data_member_location: 64
 <2><1017>: Abbrev Number: 2 (DW_TAG_member)
    <1018>   DW_AT_name        : (indirect string, offset: 0x1af08): APB2ENR
    <101c>   DW_AT_decl_file   : 4
    <101c>   DW_AT_decl_line   : 721
    <101e>   DW_AT_decl_column : 17
    <101e>   DW_AT_type        : <0xd36>
    <1022>   DW_AT_data_member_location: 68
 <2><1023>: Abbrev Number: 2 (DW_TAG_member)
    <1024>   DW_AT_name        : (indirect string, offset: 0xd2ec9): RESERVED3
    <1028>   DW_AT_decl_file   : 4
    <1028>   DW_AT_decl_line   : 722
    <102a>   DW_AT_decl_column : 17
    <102a>   DW_AT_type        : <0xd3b>
    <102e>   DW_AT_data_member_location: 72
 <2><102f>: Abbrev Number: 2 (DW_TAG_member)
    <1030>   DW_AT_name        : (indirect string, offset: 0xb6584): AHB1LPENR
